{
  "location": "Main Street Garden Park",
  "scraped_at": "2025-12-03T15:59:35.066641",
  "coordinates": {
    "latitude": 32.7811695,
    "longitude": -96.7948469
  },
  "total_reviews": 50,
  "reviews": [
    {
      "name": "waed ayoub",
      "comment": "Small but a lot of fun for kids! The area feels safe and the ground is soft, which is great if kids happen to fall while playing. Nice spot to relax while the kids enjoy themselves. Perfect for a quick family stop in downtown. 😊Comfort levelNeutral",
      "rating": "5",
      "date": "a week ago"
    },
    {
      "name": "Adam Abrahamson",
      "comment": "It's a nice open space in a sea of buildings. The open space was quite nice, and I'm glad they have it. The kids' park was also well maintained and offers a lot of climbing/obstacle course style of things to do. Very dog friendly and has cleanup and disposal options all around.",
      "rating": "5",
      "date": "8 months ago"
    },
    {
      "name": "Fatema Tuj Johora",
      "comment": "Night view: very good\nGood place to visit if you are new in Dallas.",
      "rating": "4",
      "date": "3 weeks ago"
    },
    {
      "name": "R4F4",
      "comment": "What to say about Main Street Garden Park?\n\nIt's a beautiful park in downtown Dallas.\nIt has a foosball and ping-pong table, seating area right next to a children's playground, which has structures for several age groups, there is also music playing (the little mermaid was on when we visited.)\nIt has a nice and ample grass area to play sports and shaded benches around it to sit down and relax.\n\nI highly recommend it!",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Samuel Reed",
      "comment": "The area was bright and open, with plenty of space to walk or sit. The management clearly paid attention to keeping the surroundings tidy. It was a great spot for morning exercise.",
      "rating": "2",
      "date": "a month ago"
    },
    {
      "name": "Frank EC",
      "comment": "Good park for children and dogs +6",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Mrs.Tradillion Nash",
      "comment": "I enjoy walking around the park every morning. The grounds are clean and very pretty. A good place to relax.RestroomsNoDog-friendlinessYesPicnic areaYes",
      "rating": "5",
      "date": "3 weeks ago"
    },
    {
      "name": "Sam Towns",
      "comment": "The park was conveniently located to our hotel, Residence Inn, so we came a couple times while in Dallas for the weekend. Our first impression was half of it was under construction making it hard to figure out how to get in. Once we walked around to an opening, there were homeless people everywhere just laying around or sitting and staring. So that made it a bit uncomfortable. The playground was nice for our kids to enjoy while we killed time, and the tree landscaping is well done and mature. It took me awhile to figure out where the classical music was coming from and realized it was in the park.  A nice little touch. Overall I think it'd be nice to see it on a good day because we probably caught it on an off day. But I can appreciate it for what it might usually be.",
      "rating": "4",
      "date": "2 years ago"
    },
    {
      "name": "MJ",
      "comment": "Very fun for Holloween +7",
      "rating": "4",
      "date": "4 weeks ago"
    },
    {
      "name": "the WO",
      "comment": "Nice place to go with the family.When we went there was some sort of festival going on .",
      "rating": "4",
      "date": "4 months ago"
    },
    {
      "name": "Cedrico L.",
      "comment": "Absolute beautiful array of festivities in the park near downtown Dallas.  The atmosphere was filled with food trucks(quite tasty), decorations, and people enjoying every minute of it.  Coming from Chicago, downtown Dallas seems to provide more feasible weather while outside.  It’s definitely an experience to enjoy the city and take in the sites. 10/10!",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Pogiest",
      "comment": "While visiting my brother in Downtown Dallas we walked over to the Main Street Garden Park. For the most part this park would be a nice place to visit, but in mid-November shaded by all the tall buildings it was a little chilly. The park was decorated very nicely for the holiday. As a parent however all I could think about was the safety of my children with all the homeless people in the park. It is not a place I would send my young children alone, but my kids had fun and didn't even notice all of the grown ups \"hanging out\" at the park. +2",
      "rating": "3",
      "date": "5 years ago"
    },
    {
      "name": "Sebastian Lee",
      "comment": "First I’ll be honest to say it under construction, but this does not add to my review.\n\nThis area, yet gorgeous and lying in the middle of tall skyscrapers was boring.\n\nThere is one shopping that opened just yesterday (3/28) and chairs and tables next to one of the cross sections.\n\nThere’s a nice fountain that looks like kids or dogs could run through.\n\nThis isn’t the kind of park to really have fun and s relaxing day set in mind. It’s looks to have a more purpose to serve to business folk who needs to do a phone, fresh air, or lunch break.\n\nI took my dog. On google review, there was mention of unleashing my dog on the grass...... to my disappointment, not grass. I also could not let her in an extended measure because so many people. It was just uncomfortable to bring her.\n\nFor me. As I said. Pretty park. Had places to sit. Had a view of all around.\n\nA reviewer mention about homeless people. They add to how free this park is. I did see one and they walked from one side to the other and than sat in the shade. No harm no foul. And I was ok. My attitude didn’t change on the park. +6",
      "rating": "2",
      "date": "6 years ago"
    },
    {
      "name": "Gary Thompson",
      "comment": "Great place to walk your dog and eat lunch! Great restraunts surrounding the area, and water park for kids!  Also good spot for musicians to practice!PlaygroundGreat place for kids, jungle gym included.Dog-friendlinessGreat dog park and dog friendly. Dogs are on leashes.Picnic areaGreat yard for picnics!",
      "rating": "4",
      "date": "4 months ago"
    },
    {
      "name": "Angela Ross",
      "comment": "We were in the area for another reason, but when we got there, there was an event going on in the park. My kids had a lot of fun at the event. The playground was slightly disappointing due to some of the toys being broken.PlaygroundThe playground was ok. There were a couple toys that were broken and had caution tape on them.Dog-friendlinessThere's a separate dog park. Plenty of people were walking around with their dogs.",
      "rating": "4",
      "date": "a year ago"
    },
    {
      "name": "isabel perez",
      "comment": "We love this park.  2 things this park lacks are 1. Parking 2. Bathroom.  Parking is hard to find in the downtown area.  Which is why we don't come as often as we'd",
      "rating": "4",
      "date": "2 years ago"
    },
    {
      "name": "Joel Lezama",
      "comment": "Great park right in front of the Statler! Came out at 9:30 with my with and daughter. Plenty of officers on bikes to make you feel safe, even at night. Great spot to be if your looking for some fresh air in the Downtown area.",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Juan Murray",
      "comment": "Love this place! Great for family gatherings and get togethers with friends. Friendly atmosphere, good vibes and the locals people are easy to speak to.",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "Ronda Martin",
      "comment": "We love when we have the grandbabies on any Thursday, Friday, Saturday or Sunday! Mark, the ambassador of the park for those days is so kind, helpful, and fun!! They have all kinds of activities. There is ping pong, jenga, huge blow up toys, bubbles, etc.... I was telling a friend about it and she said she visited the park when it first opened and there were to many people in park that made her a little nervous. Maybe that was true in the past but its not now. The security and Mark are great. People are kind and the area is very clean!! Thanks to the city of Dallas for giving us fun places to go for the 2 of us and for us to take the grandbabies when they visit!!",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "M W",
      "comment": "Went to the Bluey Easter event on 3/22/2025. Had a lot of fun. Kids loved it.",
      "rating": "5",
      "date": "8 months ago"
    },
    {
      "name": "val",
      "comment": "it was so beautiful and so angelic. i live in dallas, texas so where i live, there is nothing to do, so it's quite boring and no-one is really out at night. in downtown, texas, there is so many people who are up and energetic, i've never seen such beauty. i'd",
      "rating": "5",
      "date": "3 years ago"
    },
    {
      "name": "Shannon Muller",
      "comment": "Come here daily. Love the dog park. Love the fountain!\nDowntown security sets out games daily.....corn hole; bowling; +2",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Eric Larsen",
      "comment": "Nice park. There are quite a few homeless and the smell of weed was lifting in the air while I was there, but other than that",
      "rating": "3",
      "date": "a year ago"
    },
    {
      "name": "Lizzie Party",
      "comment": "Nice green space to relax in, the tall buildings surrounding it provide a lot of shade. I watched the 2024 total eclipse here in totality and it was awesome! Take advantage of whenever there are public events, as there was great ambience for the solar event. DowntownDallas is always hosting free events here. Dog-friendly!",
      "rating": "5",
      "date": "8 months ago"
    },
    {
      "name": "Debbie Lynne Flores E'ckeberger",
      "comment": "This urban attraction is known for its new modern features. An inside tip, an incredible place to see local singles & hot bods. Their wingmans are hard to resist, with cutesy pups of all ages to meet. The park offers cleaning stations for your friends, come join the fun, I may possible see you there.",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Marcos Ybarra",
      "comment": "One of the nicest places for a concert. I lucked out with beautiful weather. Great views of high rises. Not a bad spot to watch. Tripping Daisy was amazing at HG8.",
      "rating": "4",
      "date": "8 years ago"
    },
    {
      "name": "Alex Olalde",
      "comment": "Very kid and toddler friendly park in the middle of downtown, kids have lots of fun, and a dog park next it.. 👍 … +6",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Kimberley Palacios",
      "comment": "It's a great part of Dallas, we ate at Campisi's. The parking was tricky but we unbelievably found two together,  although I had to pull right up to my sisters bumper!",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Carrie Wolford",
      "comment": "Located across from The Statler on Commerce. Kid and dog friendly. There are some homeless people as with most parks downtown but I was traveling alone and I was left alone here",
      "rating": "4",
      "date": "2 years ago"
    },
    {
      "name": "Anand Arya",
      "comment": "Nice park and good options for kids to play and spend some time. Homeless people around it.",
      "rating": "4",
      "date": "5 months ago"
    },
    {
      "name": "David G",
      "comment": "Decent park, nice in the early morning otherwise there are always homeless people hanging around.",
      "rating": "3",
      "date": "a year ago"
    },
    {
      "name": "Avery Ray Wilkerson",
      "comment": "I attended the Carlsbad event at the park.\n\nThere were accessible parking, clean environment, security is constantly patrolling.RestroomsSurprisingly clean and air-conditioned",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "J Adam",
      "comment": "Friendly people and nice area to take kids.  They have a playground that is great for them to burn all that energy",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Mikhail Semykin",
      "comment": "If you want your kids to play with homeless people or your dogs to eat chicken bones thrown in bushes—this is the park for you! Lived nearby for 5 years and there’s always 5-20+ homeless people at this park at any time of day and no matter the season. Bunch of people strung out on narcotics in broad daylight while schoolchildren play in the background. The city does not care enough to clean this park properly, there’s trash everywhere everyday. Seriously, don’t let your dog’s mouths leave your vision near the bushes—there’s chicken bones everywhere. This park looks nice when there’s events going on, but besides that it’s pretty gross. Dog park is not managed often at all.",
      "rating": "1",
      "date": "9 months ago"
    },
    {
      "name": "Kristen",
      "comment": "I love Main Street Garden Park! This place is great for events & outdoor activities. When I lived in Dallas, it always seemed as though there was a concert or cool experience occurring here. I had the privilege of seeing Sarah Jaffe perform in this space a couple of times + each event was AMAZING! :-) Main Street Garden Park also has great views of Downtown Dallas, which really enhances the experience when you’re here!",
      "rating": "5",
      "date": "3 years ago"
    },
    {
      "name": "Alexis Granados",
      "comment": "I always start my downtown journey here! Cool park with a water display and a dog park along a park for kids! Wide open field in the middle for plenty of activities",
      "rating": "5",
      "date": "5 years ago"
    },
    {
      "name": "Connie Bautista",
      "comment": "Came here to view the solar eclipse.  Hopefully, the clouds goes away soon.PlaygroundWater fountain and playground for kidsRestroomsPorto potties are cleanDog-friendlinessHave their own gated play area +8",
      "rating": "4",
      "date": "a year ago"
    },
    {
      "name": "Victgor Reyes",
      "comment": "It's a really cool place to relax and take your whole family.\nI",
      "rating": "4",
      "date": "a year ago"
    },
    {
      "name": "Veronica Alonzo",
      "comment": "One of the best parks downtown for kids. The playground is modern and has a water fountain. If it had a bathroom it would be 5 stars.",
      "rating": "4",
      "date": "3 years ago"
    },
    {
      "name": "consetta moore",
      "comment": "It's nice place to relax walk your dog or just hang out.",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "Vicente Torres",
      "comment": "Used to",
      "rating": "3",
      "date": "6 years ago"
    },
    {
      "name": "Jennifer Reeves",
      "comment": "Very peaceful  and quiet!  I love to see the kid's playing in the water",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "Christopher 56 TheUS",
      "comment": "Great Experience a friend of mine works downtown and since I was in the  area today with my Dog \"Koffee\" +4",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Wayne W",
      "comment": "A place to relax and get a bite to eat. Various food trucks with many options of food. The Art Museum is close by.",
      "rating": "5",
      "date": "5 years ago"
    },
    {
      "name": "Allie Fatheree",
      "comment": "Always a lovely spot to just get out and get some fresh air. Also offers beautiful views of Downtown Dallas. Great place for photos.",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Traydale",
      "comment": "I love the park itself, I'm just not a huge fan of some of the frequent visitors. Lots of people high on very strong narcotics here. People who don't understand personal space are here. People who don't know how to allow others to enjoy the park, as well.\n\nBut the water feature and the park are beautiful.",
      "rating": "3",
      "date": "a year ago"
    },
    {
      "name": "Jarratt Willis",
      "comment": "Nice evening spot. Great attractions nearby - Hilton Statler, Dallas Municipal Building, Hotel Indigo, Dallas Morning News HQ.",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Randle Wilkerson",
      "comment": "Too many homeless people and smell",
      "rating": "1",
      "date": "5 years ago"
    },
    {
      "name": "L D Nelson",
      "comment": "Peaceful and relaxing a lil homeless community was heavily populated few areas smelled of urine but overall pleasant experience",
      "rating": "3",
      "date": "7 months ago"
    },
    {
      "name": "James Thomas Jameson III",
      "comment": "Great place for a walk on a sunny day.",
      "rating": "5",
      "date": "2 months ago"
    }
  ]
}