{
  "location": "Ferris Plaza",
  "scraped_at": "2025-12-03T15:59:56.810500",
  "coordinates": {
    "latitude": 32.7763325,
    "longitude": -96.8066006
  },
  "total_reviews": 40,
  "reviews": [
    {
      "name": "Gera Encinas Bloch",
      "comment": "Being one of the oldest plazas of Dallas, it’s elegant and full of history.Picnic areaThere are green areas where on could sit down.",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Cee Dupree",
      "comment": "Small park, tons of shade to protect you from the Texas heat. Nice views of the large Hyatt Hotel and the reunion tower. No big open grass areas. Pet friendly and clean. +2",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Mister Jon",
      "comment": "A nice small park on the edge or downtown. There is a fountain and some benches. Note: there really is not any flat area for ball games. This is more of a park that just has some green area in the middle of an urban setting. +2",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Teresa G Leon",
      "comment": "Ferris Plaza is a small but peaceful green space in downtown Dallas, great for a quick break or enjoying the city views near Union Station.",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Chelsea Turnbull",
      "comment": "We had a great time visiting Dallas. The city is beautiful and so rich with history! Every turn was unique and interesting. I can't wait to visit again!",
      "rating": "4",
      "date": "a year ago"
    },
    {
      "name": "Marvel Marvin",
      "comment": "Tourists come here thinkin’ they’ll see a few buildings and leave. But what they get is a whole feelin’. That’s Dallas for ya—big heart, big sky, big welcome.",
      "rating": "4",
      "date": "5 months ago"
    },
    {
      "name": "EL TRAZSCO MICHOACÁNO",
      "comment": "I",
      "rating": "5",
      "date": "2 weeks ago"
    },
    {
      "name": "Osvaldo Castillo",
      "comment": "If you are visiting Dallas, Reunion Tower is a good place to take a pictures from the city. +9",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Samuel Reed",
      "comment": "Families often visit here to relax and spend quality time together.",
      "rating": "3",
      "date": "a month ago"
    },
    {
      "name": "Andrew Boggs",
      "comment": "Nice little park with a cool fountain that would be perfect for eating lunch or reading a book however during the day it seems to be more of a hangout for the homeless.",
      "rating": "4",
      "date": "3 years ago"
    },
    {
      "name": "Dena Sims",
      "comment": "This little nook of a park has beautiful flowers,  a high spurting fountain and offers outdoor seating if one wants to sit for a spell and smell the roses. The flowers are perennial and can be seen year round. As I stood there admiring its glory, I wondered how spectacular it will look come spring.\n\nThe spurting fountain has approximately 6 threads appearing to shoot from underneath the ground.  It's a wonderful site to see and get pictures.\n\nI sit for a spell sometimes to admire its beauty.",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Josiah Brush",
      "comment": "A nice smallish park just across from Union Station.  Nicely landscaped and has a large fountain the kiddos will love, especially in the summer. Not really worth a special trip, it's a nice oasis to stop by when you're traveling to other places.",
      "rating": "4",
      "date": "7 years ago"
    },
    {
      "name": "Matt “Deadman” Green",
      "comment": "Beautiful little park with a fountain and a few placards with info on them. Didn't really have time to read them all or explore this little place much because we were late to get to a museum nearby. Flock of pigeons flew right through us as we walked through!",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "I C",
      "comment": "This plaza is a block away from DART streetcars last station. It's the perfect place to end after a ride through the arts district.  I give it 4 stars because it only has one wheelchair accessible ramp on the Houston St entrance.\nThe fountain was not running during my visit and there was a bit of trash floating in it. Otherwise the plaza was well maintained.  The plaza is on a number of bus routes and is across the street from the DART Blueline.  It's also a short walk from Dealey plaza.\nThe old newspaper building is on one side of the plaza while a newer hotel is on the other.\nIt's a nice place for a walk or a photo shoot.  It would be especially beautiful if the trees had lights on them and the fountain was running.",
      "rating": "4",
      "date": "4 years ago"
    },
    {
      "name": "Jerry Ellis",
      "comment": "Come for live entertainment, won't be disappointed",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Jorge Esteban",
      "comment": "Beautiful plaza in the Reunion district of downtown Dallas; opened in 1925.",
      "rating": "5",
      "date": "8 years ago"
    },
    {
      "name": "Abdullah Matalgah",
      "comment": "Beautiful park/fountain.",
      "rating": "5",
      "date": "8 years ago"
    },
    {
      "name": "Melinda Monasco",
      "comment": "This park and part of White Rock was given to my great great grand father.  For surveying the city of Dallas.  Warren Angus W.A. Ferris.  W.A. also surveyed with Lewis And Clark on the Rockie Mountains.  W.A. kept a journal and wrote Life In The Rockies.  In the 80s a Dallas Historian Susanne Starling wrote Land Is The Cry.  About W.A. Ferris.  My Grand Father was named after The city of Dallas.  Carl Dallas Ferris. As the years passed W.A. lost the deeds to the land in a house fire..  Barely able to take care of his family.  Would have not been able to take care of the land.  So it was Just forgotten in time.",
      "rating": "5",
      "date": "7 years ago"
    },
    {
      "name": "Fil Lorinc",
      "comment": "An older, but nice, small public square with accompanying fountain as the central point.",
      "rating": "4",
      "date": "2 years ago"
    },
    {
      "name": "Gustavo Bermudez",
      "comment": "Beautiful Area to relax. The fountain is gorgeous.  Definitely a spot to check out.",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Bishwas Sharma",
      "comment": "Small area to rest while roaming around downtown. There is a water fountain. You can deed the pigeons as there are plenty of them. It’s just across the union train station.",
      "rating": "4",
      "date": "3 years ago"
    },
    {
      "name": "Theresa Jolly",
      "comment": "Great park! But be careful I see aloooot of homeless bathe in the fountain",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Mark",
      "comment": "Really lovely and well-kept small park with a beautiful water fountain.",
      "rating": "4",
      "date": "5 years ago"
    },
    {
      "name": "Nora Figueroa",
      "comment": "I was on the way to Antioch Dallas Church Sunday and stopped to just send time alone with GOD! It's a beautiful spot.",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Tom Shelton",
      "comment": "Nice location.  Very small.  Fountain is nice.  Great location to lots of things to do.",
      "rating": "5",
      "date": "7 years ago"
    },
    {
      "name": "Kent Johnson",
      "comment": "Beautiful park in the traditional sense of the term! Great view to reunion tower and of union station!",
      "rating": "5",
      "date": "12 years ago"
    },
    {
      "name": "Evelyn Faulkner",
      "comment": "Nice place to visit. Great shade.you can get good photos there",
      "rating": "4",
      "date": "6 years ago"
    },
    {
      "name": "Kerry Pagano",
      "comment": "Great park with tons of open space for tossing a ball or playing chase.",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Randle Wilkerson",
      "comment": "Beautiful place to walk around in the summer and spring time",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Aaron Jackson",
      "comment": "Nice park to walk during one's train layover.",
      "rating": "5",
      "date": "12 years ago"
    },
    {
      "name": "Karlee Kakes",
      "comment": "absolutely beautiful!!",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Sandra Raynor Chapple",
      "comment": "Just checking out apartments. Nice location.",
      "rating": "4",
      "date": "7 years ago"
    },
    {
      "name": "Ina Fölscher",
      "comment": "Beautiful, clean.",
      "rating": "5",
      "date": "3 years ago"
    },
    {
      "name": "Mary Braggs",
      "comment": "Had a Great Time ! Doing JW Cart Witnessing !😍😍😍😍🤗🤗🤗🤗! …",
      "rating": "5",
      "date": "7 years ago"
    },
    {
      "name": "Andrew Pruett",
      "comment": "Nice peaceful place to read a book",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "M S",
      "comment": "Nice Place Went for Jallikattu Protest..",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "KISHA BYRD",
      "comment": "It was a nice quiet area",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Bobby Moncrief",
      "comment": "Beautiful water fountain",
      "rating": "5",
      "date": "7 years ago"
    },
    {
      "name": "Brandon Jackson",
      "comment": "Nice park to visit",
      "rating": "4",
      "date": "8 years ago"
    },
    {
      "name": "gregory harris",
      "comment": "Very nice when they open",
      "rating": "4",
      "date": "8 years ago"
    }
  ]
}