{
  "location": "Harwood Park",
  "scraped_at": "2025-12-03T16:00:20.064250",
  "coordinates": {
    "latitude": 32.7799323,
    "longitude": -96.7922153
  },
  "total_reviews": 59,
  "reviews": [
    {
      "name": "waed ayoub",
      "comment": "Harwood Park is a big, beautiful park with a lot of stuff to do. Very clean, well maintained, and perfect for families and kids. There’s plenty of space to walk, relax, and let the kids play safely. Great spot for picnics, photos, or just enjoying fresh air. Definitely a nice place to visit and unwind! 🌳😊Comfort levelNeutral",
      "rating": "5",
      "date": "a week ago"
    },
    {
      "name": "Am W",
      "comment": "I really",
      "rating": "4",
      "date": "5 months ago"
    },
    {
      "name": "Kali Khan",
      "comment": "Harwood Park is a newer addition to the city’s green spaces, offering modern landscaping, open lawns, shaded paths, and community-friendly features. It’s clean, well-lit, and designed for both relaxation and light recreation. A great spot for walking, picnics, or enjoying a quiet break downtown.",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "1616bsm",
      "comment": "Was a hot day so slides were burning, the platforms in the elephant play place had some gross stuff up in it but the playground was super cool and unique. The ground fountains were nice cuz of the heat but they shut off at 7:30ish. There were some homeless people around. Kept to themselves. A woman asked about the timing of the fountains being shut off; seemed like she wanted to “clean up” in there?\nThe field area was open and felt nice while being in the middle of the city.\nThere are 2 dog park areas. A little small but still nice to have.",
      "rating": "4",
      "date": "5 months ago"
    },
    {
      "name": "Irene Eng",
      "comment": "It looks",
      "rating": "3",
      "date": "5 months ago"
    },
    {
      "name": "Alex Canizare",
      "comment": "Great place to bring the family.  The kids had fun in the playground.   It had an open space to play soccer.  Nice sitting area. +13",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Darrell Herbert",
      "comment": "Great time with exciting people. Met a great couple from Ft. Worth that read about the park and decided to come into the city after the Rangers parade. They were delighted to see so much green development and progress of the entire area especially Deep EllumPlaygroundThe giant elephant trunks are climbers that the kids enjoyed.. It's a cool and daring playground that invites play and thought. We spent ten minutes finding the sea shells!Dog-friendlinessTwo dog Parks and am open fieldPicnic areaPicnic style tables and open space perfect for a concert. With a pavilion that's well lit. +2",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Chris Lemon",
      "comment": "Super nice park and kids’ playground structure. Visited on a chilly morning but in full sun quickly warmed up and kids had a blast!PlaygroundSuper nice playground structure, made of solid metal, not cheap plastic!Dog-friendlinessSuper dog friendly area, but no signs of dog mess or dog urine odor.",
      "rating": "5",
      "date": "11 months ago"
    },
    {
      "name": "Page Garza",
      "comment": "Opening weekend for this brand new beautiful park in downtown Dallas across from First Presbyterian Church Dallas. It was hot today.🌞 The kids were enjoying the water feature.😀RestroomsFancy brand new bathrooms for the park.Dog-friendlinessTwo separate dog areas within the park. +11",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "shervida otudor",
      "comment": "To God be the glory this park is the first time that me and my son has been here and I have to say it is very different and I",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Ashley Thompson",
      "comment": "Really nice park, different things to do!",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Nadiia Rolko",
      "comment": "Great park, lot’s of events and activities. Always bring friends to attend the events. Nice playground for kiddos",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Samuel Reed",
      "comment": "The open space gave a sense of freedom. It was easy to spend hours there without feeling crowded.",
      "rating": "3",
      "date": "a month ago"
    },
    {
      "name": "Dena Sims",
      "comment": "Beautiful park. I’d kind of still under construction. It’s a fun place and playground for the entire family. This park lights up at night and I feel safe walking about during the evening hours.\n\nThere are trees and fountains. Quite a sight.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "George Alonzo",
      "comment": "Basketball court, pickleball court and a playground for the kiddos.",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "Janel Yvette",
      "comment": "Cute little park. My kids and I enjoyed lunch and playing on the playground.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Trey Clark",
      "comment": "Grand opening was nice. The play area for kids is suitable, including face painting. Plenty of vendor tents and food truck options were available. The live music complimented the atmosphere. The one area of opportunity would be more shaded areas for hot Texas days. Overall, I would certainly revisit.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Fil Lorinc",
      "comment": "Great addition to the downtown parks initiative.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "David Dembeck",
      "comment": "I play pickleball here in the evening with a group. Very nice, clean, well maintained. There are clean public bathrooms, everything is well lit after sunset, and security patrols.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "JoLisa Johnson",
      "comment": "Love this park! Many different features including basketball court, open field, fountains and of course an amazing playground that is accessible and fun for many ages!",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Shakena King",
      "comment": "Always a relaxing and fun time here with my mom and kids!",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "Sophia Rodriguez",
      "comment": "This was such a fun park to go to. My son had a blast, as well as my puppy. I loved that the playground had a Christmas hat on one of the elephants!Dog-friendlinessI wished the door to the pet area reached the bottom. My 3month old weenie dog slipped right out from under it.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Jason Hui",
      "comment": "Looks nice. Mammoth playground. Basketball court. Nice green space. Stage for events. Big open grass area. I look forward to see what events will happen here.PlaygroundVery unique playground. They are mammoths.Dog-friendlinessSmall dog park",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Jose Guevara",
      "comment": "park, with plenty of seating and walkways.  The park has a tennis and basketball court, users will have to decide what to play first as both",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "momo morris",
      "comment": "Graduation ceremony. Nice clean park.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Enrique Pompa",
      "comment": "There are public restrooms.   The area is clean and there is a security guy walking around what makes it even better.\n\nNice place to bring the kids",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Ashley Marie Cocklin (Riellin Jane Ayda Cocklin)",
      "comment": "Beautiful with large bathroom area, water fountain, benches, tennis court, and water fun.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Jordan",
      "comment": "Very nice park! Went to the grand opening and had a great time checking it out.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Charlot Mai",
      "comment": "Great NEW public park. They didn’t skimp on lights either for optimal lighting conditions at NIGHT!",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Marcy Arias",
      "comment": "Two little dog parks, great playground, wonderful park, and bathrooms are always clean.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Hollie Mac",
      "comment": "Very cool park to walk your dogs",
      "rating": "5",
      "date": "8 months ago"
    },
    {
      "name": "J Hughes",
      "comment": "Great looking public space, top notch. Restrooms, Stage, Dog Park, Basket Ball/Pickle Ball.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "reginafwddell",
      "comment": "Really nice new park. Walking distance from the library.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Kevin O'Connell",
      "comment": "WHERE ARE THE GREEN FOSSILS!!!!! Couldn’t find em anywhere. Otherwise what a  great little park.PlaygroundNice unique touch of a playground park.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Carlos Chaves",
      "comment": "Good",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Moore Consetta",
      "comment": "I go here often to get a piece mind it's so beatuiful",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "David",
      "comment": "Very nice. A must visit.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Yessica Bautista",
      "comment": "Sept 24 th Dallas Farmers Market event! 🤭🎊 …",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Alondra Toro",
      "comment": "RestroomsAlways clean",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "Joe Cabrera",
      "comment": "Great downtown park",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Brenda Gonzales",
      "comment": "PlaygroundMy 3 year old loves this park. We use it as an alternative when we prefer a smaller crowd than Klyde Warren.",
      "rating": "5",
      "date": "11 months ago"
    },
    {
      "name": "lourdes gomez",
      "comment": "A peak neglected by weeds. Translated by Google ・ See original (Spanish)",
      "rating": "4",
      "date": "a year ago"
    },
    {
      "name": "Eric Love",
      "comment": "+3",
      "rating": "5",
      "date": "10 months ago"
    },
    {
      "name": "Lejah",
      "comment": "",
      "rating": "5",
      "date": "a week ago"
    },
    {
      "name": "Paul Pecena (captainapaullo)",
      "comment": "",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Tiffany F. Foster",
      "comment": "",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "tana hensley",
      "comment": "",
      "rating": "5",
      "date": "6 months ago"
    },
    {
      "name": "Eva Neria",
      "comment": "",
      "rating": "5",
      "date": "6 months ago"
    },
    {
      "name": "Selene Payan",
      "comment": "",
      "rating": "5",
      "date": "7 months ago"
    },
    {
      "name": "Vickie Smith",
      "comment": "",
      "rating": "5",
      "date": "8 months ago"
    },
    {
      "name": "Daniela Calabria (Comunicación gráfica)",
      "comment": "",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Nathan Adams",
      "comment": "",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Payge Stevens",
      "comment": "",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Shamim Faraji",
      "comment": "",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Ashton Tassin",
      "comment": "",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Gz Up",
      "comment": "",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Victor Martinez",
      "comment": "",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Santos Cortez",
      "comment": "",
      "rating": "4",
      "date": "2 years ago"
    },
    {
      "name": "Reginald Wright",
      "comment": "",
      "rating": "3",
      "date": "2 years ago"
    }
  ]
}