{
  "source_url": "https://www.google.com/maps/place/Klyde+Warren+Park/@32.7893644,-96.8041933,793m/data=!3m2!1e3!5s0x864e99244952e84d:0x9ca1806c5be54189!4m18!1m9!3m8!1s0x864e9924c29cfe65:0x504980b16ca5cf6a!2sKlyde+Warren+Park!8m2!3d32.7893644!4d-96.8016184!9m1!1b1!16s%2Fm%2F0465vhz!3m7!1s0x864e9924c29cfe65:0x504980b16ca5cf6a!8m2!3d32.7893644!4d-96.8016184!9m1!1b1!16s%2Fm%2F0465vhz?entry=ttu&g_ep=EgoyMDI1MTEyMy4xIKXMDSoASAFQAw%3D%3D",
  "coordinates": {
    "latitude": 32.7893644,
    "longitude": -96.8041933
  },
  "keywords": [],
  "reviews": [
    {
      "name": "Raveen Maharjan",
      "comment": "A very nice gateway park for a family with kids especially. Many activities every weekend, food trucks, live music or performances. It has a good size kids playground with water fountains. A public restrooms are readily available. Parking is little hard to get for free. Street parking is there along with garage paid parking. Some nice restaurants in the premises for nice food and refreshments. Always a fun time here!!PlaygroundyesRestroomsyesDog-friendlinessyesPicnic areayes",
      "rating": 5.0,
      "date": "3 weeks ago"
    },
    {
      "name": "Anand Neelakantan G",
      "comment": "It was an amazing experience at this park. It offers a variety of fun activities, especially for family and kids. A big water fountain and sprinklers for kids to play is a prime attraction. It has a lot of play spots, ground to relax, food trucks etc. A very good spot for picnic, time to spend with family or to stay relaxed. I drive nearly 20 miles to go the park, and play with my kid. Very near to US75 and just a small detour takes u to the park, making commute very easy",
      "rating": 5.0,
      "date": "4 months ago"
    },
    {
      "name": "ashley spencer",
      "comment": "It was a neat little walkway to the water/light show. They play music while the water and lights are going. Great place to go relax from all the city life. Its more peaceful than I thought it would be being in the middle of downtown. Kids were running around in the water and having a great time! Wonderful place. There were a few food trucks there as well",
      "rating": 4.0,
      "date": "2 months ago"
    },
    {
      "name": "Carolina Ramirez",
      "comment": "The park is beautiful! There is a water area for children that has games a big lawn and also the bathroom is very clean. While across the street they have a water area for dogs to enjoy as well. The view is beautiful and a nice place to relax and enjoy the view. I would definitely check this place out with the lights. They also have events there. Just don’t drive scooters on that block they’re not allowed in the park, so if you use them you have to park across the street.PlaygroundNo playground but there are games for little ones, a big lawn as well as the fountain to play in.RestroomsYesDog-friendlinessYes a park across the streetPicnic areaArea with tables so you can being your own food if you",
      "rating": 5.0,
      "date": "2 months ago"
    },
    {
      "name": "Jennifer Ponce",
      "comment": "It was our first time coming to klyde Warren Park and my daughters and I loved it. There was a lot to do. My daughters had fun playing in the fountains and playground. There is a lot of shade by the food trucks so it was perfect to sit on a table and grab a bite. There is also board games for the kids to play. So much to do we will definitely be back soon😊",
      "rating": 5.0,
      "date": "5 months ago"
    },
    {
      "name": "B Young",
      "comment": "Klyde Warren Park Klyde Warren Park is a 5.2–5.4 acre deck park built over the recessed Woodall Rodgers Freeway in downtown Dallas, Texas, connecting Uptown, the Arts District, and the central business district as a major urban green space and gathering spot.It offers daily free programming, food options, and a mix of lawns, playgrounds, dog parks, fountains, and event spaces, making it one of the city’s most popular public destinations. Come visit ## Location and basics\nKlyde Warren Park sits on a bridge deck spanning Woodall Rodgers Freeway between Pearl Street and St. Paul Street in the heart of downtown Dallas.[1][7][10] The park covers just over five acres and is open daily, typically from early morning to late evening, serving both residents and visitors. +26",
      "rating": 3.0,
      "date": "5 days ago"
    },
    {
      "name": "BRAY H",
      "comment": "Klyde Warren Park in Uptown, Dallas, is always clean and pristine on weekends. You can find almost every type of food truck, kids' play areas, beautiful dancing fountains with music, tables, games, and lush green grass. The park also offers some of the best views of the skyscrapers in Dallas, adjacent to downtown and Uptown. It's a great place to start your morning by walking around Uptown and downtown. Numerous events are held here, making it a vibrant part of upscale Uptown",
      "rating": 5.0,
      "date": "3 weeks ago"
    },
    {
      "name": "Edith Urbaez",
      "comment": "It’s a nice and welcoming park open to the public, with a variety of food trucks and a pet-friendly atmosphere. Perfect for family outings or catching up with friends.Dog-friendlinessYes, it’s dog friendlyPicnic areaThere are picnic areas",
      "rating": 5.0,
      "date": "4 weeks ago"
    },
    {
      "name": "Shahida bilal",
      "comment": "Klyde Warren Park is a 5-acre urban green space right in downtown Dallas, built over the Woodall Rodgers Freeway.\nWhat makes it great:\nIt’s really well designed—with lawns, a children’s playground, a dog park, water features, free public events (yoga, concerts, etc.).\nBeautiful setting: connects Uptown and the Arts District; great views; clean and well‐maintained",
      "rating": 5.0,
      "date": "2 months ago"
    },
    {
      "name": "Estreitta de Kluetz",
      "comment": "Klyde Warren Park is such a cool spot for families in downtown Dallas! We visited on a Wednesday night and loved the atmosphere. There were a few families out enjoying the evening and a live musician performing, which made it feel lively but still relaxed. Our kids had the best time playing in the splash pad, and it was the perfect way to let them burn energy while we hung out. We stayed for about an hour and could have easily stayed longer. I just wish Fort Worth had something",
      "rating": 5.0,
      "date": "2 months ago"
    },
    {
      "name": "Romario Pedraza",
      "comment": "Nice park, it is hard to find parking that's a down fall. Other then that its a great little park. I dont know if its always so full during the week but this weekend it was super full. Id try to maybe go during the week maybe its less crowded. Other then that it a different park its nice and the water show is so neat. Will definitely try again to see how it is during the week maybe less crowded and parking available.PlaygroundSeems fun, just busy in weekendsRestroomsThey are a little messyPicnic areaGreat, tables and chairs available",
      "rating": 4.0,
      "date": "5 months ago"
    },
    {
      "name": "Raul Madrid",
      "comment": "Best Park to outing with family in weekends. Food trucks around, water fountains, and nice green places in the middle of downtown",
      "rating": 5.0,
      "date": "a month ago"
    },
    {
      "name": "Abhija Jayan",
      "comment": "Klyde Warren Park is located right in the middle of Downtown Dallas and is built over an overpass. The park has a small children’s play area with limited equipment, a food-truck zone, and good security surveillance, making it a safe place to visit",
      "rating": 5.0,
      "date": "2 weeks ago"
    },
    {
      "name": "Ken Gilliano",
      "comment": "This place is totally amazing for a date night. Beautiful scenery. Over sized board games. Plenty of restaurants for dining. The even have a seasonal silent disco, (my 1st time seeing one of those). I highly recommend if you have the opportunity to go to the Klyde Warr3n Park. You take it",
      "rating": 5.0,
      "date": "a week ago"
    },
    {
      "name": "Ashley Sanchez",
      "comment": "The kids and I enjoy coming here for the food trucks or to sit outside on the patio at Mi Cocina, there is always some type of event taking place and entertainment. They have games for us to play or just sit and people watch since it such a diverse area",
      "rating": 5.0,
      "date": "a month ago"
    },
    {
      "name": "pradip shah",
      "comment": "Beautiful place to visit at evening. There are many restaurants nearby you can enjoy food",
      "rating": 4.0,
      "date": "2 months ago"
    },
    {
      "name": "Brikia C",
      "comment": "Awesome urban park within walking distance of downtown Dallas residences and attractions. Great for families, dates, or for just taking an evening stroll. There are local food trucks and eateries to explore around the perimeter of the park and amazing water features and playground for kids",
      "rating": 5.0,
      "date": "3 months ago"
    },
    {
      "name": "Yuliia Pliekhova",
      "comment": "Awesome Park is a unique and beautiful spot built right over the highway! It’s a cozy green space - clean, family-friendly, and perfect for a walk, a picnic, a date, or just relaxing. Great for kids too! +7",
      "rating": 5.0,
      "date": "7 months ago"
    },
    {
      "name": "Javier Guerrero",
      "comment": "My favorite park in Dallas!\nThere is something I like to do:\nGo have dinner at Mi Cocina, it’s right there in the middle of the park…\nAfter dinner you can walk around and enjoy the view",
      "rating": 5.0,
      "date": "4 months ago"
    },
    {
      "name": "Sathish Kumar",
      "comment": "Perfect Spot to Cool Off and Relax in Downtown Dallas! We had a great time at Klyde Warren Park! The water play area was a hit—an absolute must for the Texas heat. We also enjoyed some fun at the foosball table and other kid-friendly games available around the park. It’s a lively and relaxing place right in the heart of downtown Dallas—perfect for chilling out, playing, or just soaking in the vibe. Highly recommended for families and anyone visiting the city!PlaygroundNot a typical playground.RestroomsRestrooms are cleanPicnic areaYea. Lots of tables available to grab and hang around",
      "rating": 4.0,
      "date": "7 months ago"
    },
    {
      "name": "Animesh D",
      "comment": "Nice and busy park in the downtown. Parking is tight on weekends and needs to be on the street - paid but reasonable price $0.30 for one hour and after 6PM free. There is a children play area and well designed splash pad for kids. The overall quality and maintenance of the park is good. There’s a clean restroom present. +13",
      "rating": 5.0,
      "date": "5 months ago"
    },
    {
      "name": "Josh",
      "comment": "Extensive linear park running over the freeway adjacent to the arts district. Lined with food trucks, it has a playground, several splash pad fountains, and long walks under shade trees. There is also an place for performances. Restrooms are located in the Southside midway down the park.PlaygroundThere is a playground at the West end of the park.RestroomsThere are restrooms on the south side midway through the park.Picnic areaThere are many shaded tables and food trucks",
      "rating": 5.0,
      "date": "5 months ago"
    },
    {
      "name": "Guadalupe Landa",
      "comment": "Overall, it was an amazing park! Enough splash pads for loads of kids. We loved the small outside library, outdoor tetris, the building blocks, and the large chess sets.PlaygroundOur kids loved the playground and would stay in one section out of the many areas.RestroomsClean restrooms. 🚻 They have a changing table in each restroom.Dog-friendlinessIt's a really nice park to bring dogs, especially because if they need to go potty, there is a nearby potty station/dog park on Pearl Street.Picnic areaLoads of picnic areas and sitting areas. You can watch the kids while you eat and still be in the shade. 😎",
      "rating": 5.0,
      "date": "5 months ago"
    },
    {
      "name": "Lorens Portalatin",
      "comment": "Love coming to Klyde Warren Park on Sundays for free yoga classes! You bring your own mat and whatever else you may need to feel comfy in the Texas heat while working out and enjoy 45 minutes of a guided yoga session. They also have activities for kids, park areas, and there are food trucks located nearby if you’re looking for something to eat. Parking is harder to come by so highly recommend giving yourself an extra 15 minutes to find it before any scheduled event.RestroomsThere are restrooms accessible in the park.Dog-friendlinessYou can walk your dogs on a leash in the park.Picnic areaLots of places to sit and enjoy a meal whether it’s from a park restaurant, food truck or a picnic you enjoy on the grass",
      "rating": 5.0,
      "date": "3 months ago"
    },
    {
      "name": "Rickie Lindley",
      "comment": "Wow! Visiting this park was an absolute delight! The kids' splash area was a hit with my little ones, providing endless hours of fun and laughter. And let's talk about the food trucks – they were simply phenomenal! From mouthwatering burgers to delicious tacos, there was something for everyone. The ambiance was fantastic, with plenty of shaded seating areas to relax and enjoy our meals. It's safe to say, this park has become our new favorite spot for family outings. Highly recommended! +6",
      "rating": 5.0,
      "date": "a year ago"
    },
    {
      "name": "Frankie Webb",
      "comment": "We decided last minute as we were passing by, to stop today. It was A perfect day for a",
      "rating": 5.0,
      "date": "3 months ago"
    },
    {
      "name": "Niluksha Wickramaarachchi",
      "comment": "We had an amazing time at Klyde Warren Park in Dallas! The highlight for us was definitely the giant chess and checkers board. It was so much fun to challenge each other and enjoy a friendly game in such a beautiful setting. The park itself is well-maintained, with plenty of green space, food trucks, and activities for everyone. It's a fantastic spot to relax, play, and soak in the vibrant atmosphere of the city. Highly recommend a visit!",
      "rating": 5.0,
      "date": "8 months ago"
    },
    {
      "name": "Peyman Yazdizadeh",
      "comment": "This park is a charming and cozy spot, perfect for both kids and dogs. The play areas are well-maintained, offering a safe and fun environment for children, while the open spaces are great for dogs to run around. It’s a peaceful place with plenty of seating, making it ideal for families to relax and enjoy time outdoors",
      "rating": 5.0,
      "date": "a year ago"
    },
    {
      "name": "Vineeth kumar T",
      "comment": "Great place for kids and families with best splash pad for kids, play area and open grass field. Bunch of food trucks around and paid parking around.RestroomsPublic restrooms are available at back of Mi CocinaPicnic areaBest picnic area for city view",
      "rating": 5.0,
      "date": "5 months ago"
    },
    {
      "name": "Louie K’s Up",
      "comment": "This park is more than green grass and skyline views it’s a breath of fresh purpose. From the playground to the food trucks, Klyde Warren is where families, dreamers, and legacy builders come to recharge. I brought my kids, walked through with my wife, and even sat alone just thanking God for how far we’ve come. ✅ Clean restrooms\n✅ Playground stays packed with joy\n✅ Dog-friendly for real not just by sign\n✅ Perfect picnic energy with space to just be You’ll see culture, peace, art, and resilience all in one stroll. Whether you need clarity, connection, or just a reason to smile this park delivers. Louie K’s Up approved. 🔥💯🧡",
      "rating": 5.0,
      "date": "5 months ago"
    },
    {
      "name": "Harrison DeMoss",
      "comment": "Tasty food options, nice atmosphere, and a good location. This park is always full of life and energy. There's so many things for kids to do here. There are events every week and rotating food trucks. The proximity to the arts district makes this a good addition to an art museum date or family day trip. This park is an iconic landmark of Dallas that is worth checking out. Especially if you have kids.Dog-friendlinessThere are lots of dogs everywhere",
      "rating": 5.0,
      "date": "a month ago"
    },
    {
      "name": "Rachel Morgan",
      "comment": "I stop by this park often because they always have something fun going on. This past weekend, I had the pleasure of being a vendor at their adoption event. As the owner of a dog events company, Pampered Pooch Events, I was more than impressed with their team. My amazing point of contact, the man who made sure everything ran smoothly, was Cruz. He did everything he said he would do when he said he would do it. He made it easy to handle setup, parking, and checked on everyone throughout the event. This was by far the best experience I’ve had working with Cruz, the MVP overseeing their events",
      "rating": 5.0,
      "date": "2 weeks ago"
    },
    {
      "name": "Vinod Gubba",
      "comment": "This is an awesome park in the Dallas downtown area. Kids will have fun time playing here. Lot of food trucks with variety of food options",
      "rating": 5.0,
      "date": "a month ago"
    },
    {
      "name": "SAMUEL TURRUBIARTE",
      "comment": "My visit to Klyde Warren Park in downtown Dallas was nothing short of amazing. We went on a Sunday morning and had no trouble finding plenty of meter parking in the area. This charming park is nestled right on an expressway, surrounded by the tall downtown buildings, which adds a unique urban vibe to the experience.The atmosphere was vibrant, with live music filling the air and vendors selling beautiful artwork and unique pieces. The food trucks lining the park offered a fantastic selection of delicious eats, making it the perfect spot to relax and enjoy the day. I would most definitely come back to Klyde Warren Park and highly recommend it to anyone looking for a fun and lively spot in the heart of the city.Playgroundincredible playground for kids, filled with tons of unique jungle gyms that kept the little ones entertained for hours. It’s a perfect destination for families looking for a fun, engaging outing.RestroomsThere were restrooms in the park that we could use and they were clean.Dog-friendlinessThe park was also very pet-friendly—there was even a dog event that weekend, adding to the lively and welcoming environment. It’s a perfect destination for families and pet owners a",
      "rating": 5.0,
      "date": "a year ago"
    },
    {
      "name": "Six Wishez",
      "comment": "The park is nice with the amenities, but its too dark there is minimal lights and you cant see your hand before you face. Itz actually kinda weird.. the children playing in the dark cant see the balls. Whose idea was that",
      "rating": 3.0,
      "date": "2 months ago"
    },
    {
      "name": "Lisa Johnston",
      "comment": "There should be a bit more security or police presence. Creepy guy on a video chat put his phone inches from my grandson's face after getting a full length back & front view. I got VERY LOUD & the guy left but the officer I spoke with basically said that it is a public place so he couldn't do anything about it. THAT is not ok! Parents beware!",
      "rating": 4.0,
      "date": "4 months ago"
    },
    {
      "name": "michael kilderry",
      "comment": "It's a cute little park. Clean, and has play area for children",
      "rating": 3.0,
      "date": "4 months ago"
    },
    {
      "name": "Merritt Glover",
      "comment": "This is a lovely example of what a city can provide to the community. Giant chess, splash pad fountains, music, tables and chairs giant connect 4, food trucks! So much silly fun. +2",
      "rating": 5.0,
      "date": "6 months ago"
    }
  ]
}