{
  "location": "Klyde Warren Park",
  "scraped_at": "2025-12-03T16:03:18.481318",
  "coordinates": {
    "latitude": 32.7893644,
    "longitude": -96.8016184
  },
  "total_reviews": 98,
  "reviews": [
    {
      "name": "Raveen Maharjan",
      "comment": "A very nice gateway park for a family with kids especially. Many activities every weekend, food trucks, live music or performances.\n\nIt has a good size kids playground with water fountains. A public restrooms are readily available.\n\nParking is little hard to get for free. Street parking is there along with garage paid parking. Some nice restaurants in the premises for nice food and refreshments.\n\nAlways a fun time here!!PlaygroundyesRestroomsyesDog-friendlinessyesPicnic areayes",
      "rating": "5",
      "date": "3 weeks ago"
    },
    {
      "name": "Anand Neelakantan G",
      "comment": "It was an amazing experience at this park. It offers a variety of fun activities, especially for family and kids. A big water fountain and sprinklers for kids to play is a prime attraction. It has a lot of play spots, ground to relax, food trucks etc.\n\nA very good spot for picnic, time to spend with family or to stay relaxed. I drive nearly 20 miles to go the park, and play with my kid.\n\nVery near to US75 and just a small detour takes u to the park, making commute very easy.",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "ashley spencer",
      "comment": "It was a neat little walkway to the water/light show. They play music while the water and lights are going. Great place to go relax from all the city life. Its more peaceful than I thought it would be being in the middle of downtown. Kids were running around in the water and having a great time! Wonderful place. There were a few food trucks there as well.",
      "rating": "4",
      "date": "2 months ago"
    },
    {
      "name": "Carolina Ramirez",
      "comment": "The park is beautiful! There is a water area for children that has games a big lawn and also the bathroom is very clean. While across the street they have a water area for dogs to enjoy as well. The view is beautiful and a nice place to relax and enjoy the view. I would definitely check this place out with the lights. They also have events there. Just don’t drive scooters on that block they’re not allowed in the park, so if you use them you have to park across the street.PlaygroundNo playground but there are games for little ones, a big lawn as well as the fountain to play in.RestroomsYesDog-friendlinessYes a park across the streetPicnic areaArea with tables  so you can being your own food if you",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Jennifer Ponce",
      "comment": "It was our first time coming to klyde Warren Park and my daughters and I loved it. There was a lot to do. My daughters had fun playing in the fountains and playground. There is a lot of shade by the food trucks so it was perfect to sit on a table and grab a bite. There is also board games for the kids to play. So much to do we will definitely be back soon😊",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "B Young",
      "comment": "Klyde Warren Park\n\nKlyde Warren Park is a 5.2–5.4 acre deck park built over the recessed Woodall Rodgers Freeway in downtown Dallas, Texas, connecting Uptown, the Arts District, and the central business district as a major urban green space and gathering spot.It offers daily free programming, food options, and a mix of lawns, playgrounds, dog parks, fountains, and event spaces, making it one of the city’s most popular public destinations. Come visit\n\n## Location and basics\nKlyde Warren Park sits on a bridge deck spanning Woodall Rodgers Freeway between Pearl Street and St. Paul Street in the heart of downtown Dallas.[1][7][10] The park covers just over five acres and is open daily, typically from early morning to late evening, serving both residents and visitors. +26",
      "rating": "3",
      "date": "a week ago"
    },
    {
      "name": "BRAY H",
      "comment": "Klyde Warren Park in Uptown, Dallas, is always clean and pristine on weekends. You can find almost every type of food truck, kids' play areas, beautiful dancing fountains with music, tables, games, and lush green grass. The park also offers some of the best views of the skyscrapers in Dallas, adjacent to downtown and Uptown. It's a great place to start your morning by walking around Uptown and downtown. Numerous events are held here, making it a vibrant part of upscale Uptown.",
      "rating": "5",
      "date": "3 weeks ago"
    },
    {
      "name": "Edith Urbaez",
      "comment": "It’s a nice and welcoming park open to the public, with a variety of food trucks and a pet-friendly atmosphere. Perfect for family outings or catching up with friends.Dog-friendlinessYes, it’s dog friendlyPicnic areaThere are picnic areas",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Shahida bilal",
      "comment": "Klyde Warren Park is a 5-acre urban green space right in downtown Dallas, built over the Woodall Rodgers Freeway.\nWhat makes it great:\nIt’s really well designed—with lawns, a children’s playground, a dog park, water features, free public events (yoga, concerts, etc.).\nBeautiful setting: connects Uptown and the Arts District; great views; clean and well‐maintained.",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Estreitta de Kluetz",
      "comment": "Klyde Warren Park is such a cool spot for families in downtown Dallas! We visited on a Wednesday night and loved the atmosphere. There were a few families out enjoying the evening and a live musician performing, which made it feel lively but still relaxed. Our kids had the best time playing in the splash pad, and it was the perfect way to let them burn energy while we hung out.\n\nWe stayed for about an hour and could have easily stayed longer. I just wish Fort Worth had something",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Romario Pedraza",
      "comment": "Nice park, it is hard to find parking that's a down fall. Other then that its a great little park. I dont know if its always so full during the week but this weekend it was super full. Id try to maybe go during the week maybe its less crowded. Other then that it a different park its nice and the water show is so neat. Will definitely try again to see how it is during the week maybe less crowded and parking available.PlaygroundSeems fun, just busy in weekendsRestroomsThey are a little messyPicnic areaGreat, tables and chairs available.",
      "rating": "4",
      "date": "5 months ago"
    },
    {
      "name": "Raul Madrid",
      "comment": "Best Park to outing with family in weekends.\n\nFood trucks around, water fountains, and nice green places in the middle of downtown.",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Abhija Jayan",
      "comment": "Klyde Warren Park is located right in the middle of Downtown Dallas and is built over an overpass. The park has a small children’s play area with limited equipment, a food-truck zone, and good security surveillance, making it a safe place to visit",
      "rating": "5",
      "date": "2 weeks ago"
    },
    {
      "name": "Ken Gilliano",
      "comment": "This place is totally amazing for a date night. Beautiful scenery. Over sized board games. Plenty of restaurants for dining.  The even have a seasonal silent disco, (my 1st time seeing one of those). I highly recommend if you have the opportunity to go to the Klyde Warr3n Park. You take it.",
      "rating": "5",
      "date": "a week ago"
    },
    {
      "name": "Ashley Sanchez",
      "comment": "The kids and I enjoy coming here  for the food trucks or to sit outside on the patio at Mi Cocina, there is always some type of event taking place and entertainment. They have games for us to play or just sit and people watch since it such a diverse area.",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "pradip shah",
      "comment": "Beautiful place to visit at evening. There are many restaurants nearby you can enjoy food.",
      "rating": "4",
      "date": "2 months ago"
    },
    {
      "name": "Brikia C",
      "comment": "Awesome urban park within walking distance of downtown Dallas residences and attractions. Great for families, dates, or for just taking an evening stroll. There are local food trucks and eateries to explore around the perimeter of the park and amazing water features and playground for kids.",
      "rating": "5",
      "date": "3 months ago"
    },
    {
      "name": "Yuliia Pliekhova",
      "comment": "Awesome Park is a unique and beautiful spot built right over the highway! It’s a cozy green space - clean, family-friendly, and perfect for a walk, a picnic, a date, or just relaxing. Great for kids too! +7",
      "rating": "5",
      "date": "7 months ago"
    },
    {
      "name": "waed ayoub",
      "comment": "Klyde Warren Park is such a beautiful spot in the heart of Dallas! Clean, relaxing, and full of life. Perfect for families, kids, or just a peaceful walk. There’s a great playground, open green space, food trucks, and fun activities happening all the time. Kids can run freely while adults enjoy the calm vibe and city views. A perfect place to relax, picnic, and enjoy fresh air. Highly recommend for a fun and refreshing day out! 💚",
      "rating": "5",
      "date": "6 days ago"
    },
    {
      "name": "Javier Guerrero",
      "comment": "My favorite park in Dallas!\nThere is something I like to do:\nGo have dinner at Mi Cocina, it’s right there in the middle of the park…\nAfter dinner you can walk around and enjoy the view.",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "Sathish Kumar",
      "comment": "Perfect Spot to Cool Off and Relax in Downtown Dallas!\n\nWe had a great time at Klyde Warren Park! The water play area was a hit—an absolute must for the Texas heat. We also enjoyed some fun at the foosball table and other kid-friendly games available around the park. It’s a lively and relaxing place right in the heart of downtown Dallas—perfect for chilling out, playing, or just soaking in the vibe. Highly recommended for families and anyone visiting the city!PlaygroundNot a typical playground.RestroomsRestrooms are cleanPicnic areaYea. Lots of tables available to grab and hang around.",
      "rating": "4",
      "date": "7 months ago"
    },
    {
      "name": "Animesh D",
      "comment": "Nice and busy park in the downtown. Parking is tight on weekends and needs to be on the street - paid but reasonable price $0.30 for one hour and after 6PM free. There is a children play area and well designed splash pad for kids. The overall quality and maintenance of the park is good. There’s a clean restroom present. +13",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "Josh",
      "comment": "Extensive linear park running over the freeway adjacent to the arts district. Lined with food trucks, it has a playground, several splash pad fountains, and long walks under shade trees. There is also an place for performances. Restrooms are located in the Southside midway down the park.PlaygroundThere is a playground at the West end of the park.RestroomsThere are restrooms on the south side midway through the park.Picnic areaThere are many shaded tables and food trucks.",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "Guadalupe Landa",
      "comment": "Overall, it was an amazing park! Enough splash pads for loads of kids. We loved the small outside library, outdoor tetris, the building blocks, and the large chess sets.PlaygroundOur kids loved the playground and would stay in one section out of the many areas.RestroomsClean restrooms. 🚻 They have a changing table in each restroom.Dog-friendlinessIt's a really nice park to bring dogs, especially because if they need to go potty, there is a nearby potty station/dog park on Pearl Street.Picnic areaLoads of picnic areas and sitting areas. You can watch the kids while you eat and still be in the shade. 😎",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "Lorens Portalatin",
      "comment": "Love coming to Klyde Warren Park on Sundays for free yoga classes! You bring your own mat and whatever else you may need to feel comfy in the Texas heat while working out and enjoy 45 minutes of a guided yoga session. They also have activities for kids, park areas, and there are food trucks located nearby if you’re looking for something to eat. Parking is harder to come by so highly recommend giving yourself an extra 15 minutes to find it before any scheduled event.RestroomsThere are restrooms accessible in the park.Dog-friendlinessYou can walk your dogs on a leash in the park.Picnic areaLots of places to sit and enjoy a meal whether it’s from a park restaurant, food truck or a picnic you enjoy on the grass.",
      "rating": "5",
      "date": "3 months ago"
    },
    {
      "name": "Rickie Lindley",
      "comment": "Wow! Visiting this park was an absolute delight! The kids' splash area was a hit with my little ones, providing endless hours of fun and laughter. And let's talk about the food trucks – they were simply phenomenal! From mouthwatering burgers to delicious tacos, there was something for everyone. The ambiance was fantastic, with plenty of shaded seating areas to relax and enjoy our meals. It's safe to say, this park has become our new favorite spot for family outings. Highly recommended! +6",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Frankie Webb",
      "comment": "We decided last minute as we were passing by, to stop today.  It was A perfect day for a",
      "rating": "5",
      "date": "3 months ago"
    },
    {
      "name": "Niluksha Wickramaarachchi",
      "comment": "We had an amazing time at Klyde Warren Park in Dallas! The highlight for us was definitely the giant chess and checkers board. It was so much fun to challenge each other and enjoy a friendly game in such a beautiful setting. The park itself is well-maintained, with plenty of green space, food trucks, and activities for everyone. It's a fantastic spot to relax, play, and soak in the vibrant atmosphere of the city. Highly recommend a visit!",
      "rating": "5",
      "date": "8 months ago"
    },
    {
      "name": "Peyman Yazdizadeh",
      "comment": "This park is a charming and cozy spot, perfect for both kids and dogs. The play areas are well-maintained, offering a safe and fun environment for children, while the open spaces are great for dogs to run around. It’s a peaceful place with plenty of seating, making it ideal for families to relax and enjoy time outdoors.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Vineeth kumar T",
      "comment": "Great place for kids and families with best splash pad for kids, play area and open grass field. Bunch of food trucks around and paid parking around.RestroomsPublic restrooms are available at back of Mi CocinaPicnic areaBest picnic area for city view",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "Louie K’s Up",
      "comment": "This park is more than green grass and skyline views it’s a breath of fresh purpose.\n\nFrom the playground to the food trucks, Klyde Warren is where families, dreamers, and legacy builders come to recharge. I brought my kids, walked through with my wife, and even sat alone just thanking God for how far we’ve come.\n\n✅ Clean restrooms\n✅ Playground stays packed with joy\n✅ Dog-friendly for real not just by sign\n✅ Perfect picnic energy with space to just be\n\nYou’ll see culture, peace, art, and resilience all in one stroll. Whether you need clarity, connection, or just a reason to smile this park delivers.\n\nLouie K’s Up approved. 🔥💯🧡",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "Harrison DeMoss",
      "comment": "Tasty food options, nice atmosphere, and a good location. This park is always full of life and energy. There's so many things for kids to do here. There are events every week and rotating food trucks. The proximity to the arts district makes this a good addition to an art museum date or family day trip.\n\nThis park is an iconic landmark of Dallas that is worth checking out. Especially if you have kids.Dog-friendlinessThere are lots of dogs everywhere",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Vinod Gubba",
      "comment": "This is an awesome park in the Dallas downtown area. Kids will have fun time playing here.  Lot of food trucks with variety of food options.",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Rachel Morgan",
      "comment": "I stop by this park often because they always have something fun going on. This past weekend, I had the pleasure of being a vendor at their adoption event.\n\nAs the owner of a dog events company, Pampered Pooch Events, I was more than impressed with their team. My amazing point of contact, the man who made sure everything ran smoothly, was Cruz. He did everything he said he would do when he said he would do it. He made it easy to handle setup, parking, and checked on everyone throughout the event. This was by far the best experience I’ve had working with Cruz, the MVP overseeing their events.",
      "rating": "5",
      "date": "3 weeks ago"
    },
    {
      "name": "SAMUEL TURRUBIARTE",
      "comment": "My visit to Klyde Warren Park in downtown Dallas was nothing short of amazing. We went on a Sunday morning and had no trouble finding plenty of meter parking in the area. This charming park is nestled right on an expressway, surrounded by the tall downtown buildings, which adds a unique urban vibe to the experience.The atmosphere was vibrant, with live music filling the air and vendors selling beautiful artwork and unique pieces. The food trucks lining the park offered a fantastic selection of delicious eats, making it the perfect spot to relax and enjoy the day. I would most definitely come back to Klyde Warren Park and highly recommend it to anyone looking for a fun and lively spot in the heart of the city.Playgroundincredible playground for kids, filled with tons of unique jungle gyms that kept the little ones entertained for hours. It’s a perfect destination for families looking for a fun, engaging outing.RestroomsThere were restrooms in the park that we could use and they were clean.Dog-friendlinessThe park was also very pet-friendly—there was even a dog event that weekend, adding to the lively and welcoming environment. It’s a perfect destination for families and pet owners a",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Six Wishez",
      "comment": "The park is nice with the amenities, but its too dark there is minimal lights and you cant see your hand before you face. Itz actually kinda weird.. the children playing in the dark cant see the balls. Whose idea was that?",
      "rating": "3",
      "date": "2 months ago"
    },
    {
      "name": "Lisa Johnston",
      "comment": "There should be a bit more security or police presence. Creepy guy on a video chat put his phone inches from my grandson's face after getting a full length back & front view. I got VERY LOUD & the guy left but the officer I spoke with basically said that it is a public place so he couldn't do anything about it. THAT is not ok!\n\nParents beware!",
      "rating": "4",
      "date": "4 months ago"
    },
    {
      "name": "michael kilderry",
      "comment": "It's a cute little park. Clean, and has play area for children.",
      "rating": "3",
      "date": "4 months ago"
    },
    {
      "name": "Merritt Glover",
      "comment": "This is a lovely example of what a city can provide to the community. Giant chess, splash pad fountains, music, tables and chairs giant connect 4, food trucks! So much silly fun. +2",
      "rating": "5",
      "date": "6 months ago"
    },
    {
      "name": "Natali DZ",
      "comment": "Klyde Warren Park is one of those magical places that makes Dallas feel alive.\n\nEvery time we come here, it feels like a little celebration — families laughing, kids running around, food trucks cooking something delicious, music in the air. It’s the kind of place where you instantly relax and want to stay longer than planned.\nIf you’re new to Dallas or visiting, this is a MUST. ✨PlaygroundChilds LOVES it here. The playground is clean, safe, and full of activities for all ages. It’s one of the few places where I can sit back, enjoy the moment, and know my kid is having the best time.RestroomsSurprisingly clean and well-maintained — a big deal for parents! Everything is close to the playground, which is super convenient.Dog-friendlinessSuch a welcoming spot for dogs! Lots of open space, shade, and water stations. Perfect for a family + pets day out.",
      "rating": "5",
      "date": "a week ago"
    },
    {
      "name": "Samuel Reed",
      "comment": "The place was calm and relaxing. The open space had a refreshing atmosphere that made it perfect for an evening walk. People were friendly, and the area looked clean and safe. It felt good to spend quiet time surrounded by nature.",
      "rating": "3",
      "date": "a month ago"
    },
    {
      "name": "Mesfin M",
      "comment": "This place is a fantastic destination for both kids and adults, offering a wide variety of activities that cater to all ages. Children will love the vibrant water park, engaging books, classic Tetris games, and the fun-filled playground. Adults can unwind with a game of tennis or chess, relax at scenic camping spots, or enjoy the diverse culinary options from restaurants and food trucks. Whether you’re looking for adventure or relaxation, there’s something here for everyone. With so much to do, boredom simply isn’t an option!",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Jocelyn Shivers",
      "comment": "Nice park and family area, they had outdoor games and board games, ping pong, grass to run and play, food trucks, info center. It was a nice little place to have family time and there was a restaurant for dinner. They had a live event on this particular day we went so parking was a thing. We did find a garage that was $5-$30 to park across the street depending on time.",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Cecilio Lopez",
      "comment": "It is a very peaceful park in the middle of chaos here in Downtown Dallas. Including a kids park,water park, and dog park. I was there for the Alzheimers cause/awareness walk with many others.PlaygroundSmall kids area by quite a big field for activities to do with the kids.RestroomsThere restrooms are very clean.Dog-friendlinessYes, it is a dog friendly park",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Devyn R",
      "comment": "Beautiful park area to walk around and occasionally attend events. With good weather, this is the perfect spot to chill out at. There's a play area for children and cool water fountain structures. Could have a picnic here too.",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Chris Salazar",
      "comment": "A great park in downtown Dallas! Conveniently located across the street from the Dallas Art Museum, it’s a perfect spot to hang out. The variety of food trucks adds to the experience. The kids had a blast playing and enjoyed a lovely lunch on a beautiful fall day. We’ll definitely be back! +3",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Kevin Lopez",
      "comment": "If you’re planning to hang out in downtown Dallas, I suggest visiting this park. It offers great views of the city for photos, and there’s always something happening, such as activities, food stands, live music, or simply a nice place to relax.\n\nFinding parking spots is easy during the weekdays, but it can be crowded and challenging to find parking close to the park on weekends.\n\nAdditionally, the park has good trails for running and walking dogs. 🫡PlaygroundNice playgroung and other games for kidsRestroomsPublic restroomsPicnic areaThere are tables and chairs",
      "rating": "4",
      "date": "a year ago"
    },
    {
      "name": "Karthick Ramani",
      "comment": "A great place to hangout for a few hours if going with friends or family. It's got a amazing vibe and great spots for photo ops. The whole stretch is surrounded with food trucks, coffee shops and play areas.  I recommend going around sunset time to enjoy the place during the day and also see the vibrant colors when dark.",
      "rating": "5",
      "date": "11 months ago"
    },
    {
      "name": "Chris Johnson",
      "comment": "I visited Klyde Warren Park on March 17 2025. I went with my sister, 10 year old niece & 8 year old nephew. We were there for 3 hours. The kids enjoyed playing, sis & I watched them play while chatting. We all grabbed some food from the food trucks. Such a wonderful place for the family to get out of the house & get some fresh air.",
      "rating": "5",
      "date": "8 months ago"
    },
    {
      "name": "Jacqueline",
      "comment": "This park is beautiful and it felt safe, even being in the middle of a busy city. It was",
      "rating": "4",
      "date": "a year ago"
    },
    {
      "name": "Bret Ostendorf",
      "comment": "Awesome park with skyscrapers around and plenty for kids to play on. Lots of food trucks and restaurants.",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "Marilou Telchik",
      "comment": "Beautiful park, so many food trucks.  We're glad we came end of November we got to enjoy the colors of the trees.PlaygroundYesRestroomsYesDog-friendlinessYesPicnic areaLots of picnic tables and chairs",
      "rating": "5",
      "date": "10 months ago"
    },
    {
      "name": "Marco Alvarez",
      "comment": "Had a wonderful time at this park! There's a wide range of fun activities, particularly great for families and children.One of the main highlights is the large water fountain and sprinklers where kids can splash around and have a blast.The park also features plenty of play areas, open spaces to unwind and food trucks offering tasty options.Perfect place for a picnic,quality family time, or just to relax and enjoy the outdoors.",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Bishwas Sharma",
      "comment": "Nice park right in the downtown. Plenty of stuffs to do in not-so-big park. Good for kids as there are playgrounds and fountains. Various events are organized on this park. Today (April 15,2023) there was Festival of Joy. Park was really busy but everyone were having fun. Parking might be challenging right there but there are plenty of commercial parking lots in walking distance at about $10.",
      "rating": "4",
      "date": "2 years ago"
    },
    {
      "name": "Alan Chumbley",
      "comment": "Nice and easily accessible park near downtown with a few play and exploration areas for kids. There's also a water fountain play area that's nice for cooling off in the heat and a small amphitheater for concerts and plays. Some really good food trucks line both sides of the park that are worth exploring and a Mi Cocina sit down restaurant as well.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Briana Sneddon",
      "comment": "This park is busy, it has taco trucks, the best park for kids, a lawn area to chill or play sports, and a beautiful water show. Pretty at night or during the dayPlaygroundMy kids love the playground and then ice cream afterRestroomsNever used them but they are availableDog-friendlinessDon't bring your dog. They can't go into the park and it's just not enough space. We don't want to hear dogs or step in their poop. I love dogs. But not herePicnic areaLots of areas +4",
      "rating": "5",
      "date": "9 months ago"
    },
    {
      "name": "Ryan Novotni",
      "comment": "Really nice, central little greenspace and park to take some time and relax while walking around. There's all kinds of seating, games (my buddy and I spent some time playing Ping Pong & Foozball), and food trucks all over with lots of reasonably priced options. It was refreshing seeing everybody having a good time and just enjoying life with their families and friends, mostly free of phones or other distractions.",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "C Poole",
      "comment": "Such a great vibe! We visited on a summer evening and enjoyed the fountain's light and music show. Lots of families enjoying the atmosphere throughout the park. We parked at the \"Park Fast\" parking garage, which was about a 2 min walk away.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Michelle Massaro",
      "comment": "Fun! Lots to do, lots to see & lots to eat! Awesome variety of food trucks with gluten free, vegetarian & vegan options at several. Great active park with very unique play equipment, a fountain that's fun to walk through on a hot day, flat paved walking paths throughout, and lots of seating. Beautiful all lit up in the evening. +8",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Ashley",
      "comment": "Nice park located in downtown Dallas! Large game boards and playground! My son enjoyed his birthday weekend! +10",
      "rating": "5",
      "date": "7 months ago"
    },
    {
      "name": "Anastasiia Yemets",
      "comment": "A cool place where everyone can find something to do. I recently arrived in Dallas and this park attracted me to yoga and Pilates on weekends. I see that festivals, master classes and theme nights often take place here.\nI'm really looking forward to seeing the fountains start working)))\n\nWar is not over!\nStand with Ukraine! 💙💛 +3",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Kimberly Ballard",
      "comment": "Fun. Family friendly. We spent an hour or so playing their ping pong and enjoying the food trucks. The fountain was cool, wish we had had time to stay for the light show.PlaygroundSplash pad and giant games",
      "rating": "4",
      "date": "2 months ago"
    },
    {
      "name": "RM CP",
      "comment": "Beautiful and modern park in downtown Dallas with stage shows, landscapes for games or birthday parties or picnics, splash pads for kids, play area for younger kids, recreational table games, fountain shows, many food, ice cream trucks around, nearby speciality restaurants, hotels, tram car ride and horse carriage rides, book shelf, large seating capacity, many tables, chairs, benches, enough lighting. Also you find plenty of free or metered or paid parking available around this park. There are onsite walking trails, rest rooms available as well. This place provides fun for all age groups. You can take coolers, strollers, pets allowed.PlaygroundEnough for kids up to age 10-12Dog-friendlinessYesPicnic areaPlenty +19",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Jyothi Prasad",
      "comment": "Easter Friday was a great time to visit this park. Great play area for children . They had a blast!! Many games and fun filled activities were organised by the church ; a live stage for the music was being set up for the evening! Face painting, Easter egg decorating; and several activities for children! The food trucks were awesome as they rolled out dishes non stop ! The rolls, the fries and the salads were yum. 👍👍",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Linzee Ott",
      "comment": "A stunning public park resulting from best-practice public-private partnerships. We stumbled upon a local makers’ market the day we visited. Absolutely lovely park. +2",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Fernando Toledo",
      "comment": "Clean and nice, they have good activities and areas for kids, they have food trucks with good food, tables to have lunch, there is usually someone cleaning the tables.",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "James Klein",
      "comment": "This place is hopping!!! Diverse families, diverse food trucks. Kids playing, yoga in the park and music on stage. Everyone having fun. Super awesome playground for big kids and another for the younger ones. Water play and a soft play area. Nice job Dallas! +11",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Nikitha Tammareddy",
      "comment": "It is a fantastic spot in Dallas. It’s a lively, green space with plenty of food trucks, a cool playground, and lots of events. It’s well-maintained and offers a great escape from the city hustle. Perfect for families, friends, or anyone looking to relax outdoors. +2",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Tiago Carvalho",
      "comment": "This park is awesome! They have an amazing structure for the kids. The floor, playground it is all save to avoid accidents and injuries. They also have a splash area for summer and hot days - it’s great for all seasons. Outside they have food trucks around, so you can get some food, ice cream… and parking you can find public parking on the road.PlaygroundThe playground is very fan, good for any season of the year.RestroomsYes, they do have it.Dog-friendlinessYes, many people with dogs and a big grass area to play with your pet.Picnic areaThey have many tables, you can buy food from the food trucks or bring your from home.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Jerry Connell",
      "comment": "I really enjoyed the park. The only drawback is the price of the food trucks. Otherwise,  we had a good time.",
      "rating": "4",
      "date": "6 months ago"
    },
    {
      "name": "DeShona Green",
      "comment": "I have to go back soon, loved the other water park!! +6",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "Awab Hassabelnabi",
      "comment": "I enjoyed my one visit to this park recently +12",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "elle fore",
      "comment": "Every time we visit Dallas something is going on at this park. Today was an Indian festival. Very cool to see. +4",
      "rating": "5",
      "date": "7 months ago"
    },
    {
      "name": "Ashok Bandyopadhyay",
      "comment": "Not at all crowded on a weekday evening. Nice place for a peaceful stroll",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Jessica P",
      "comment": "Excellent splash pad perfect for kids of all ages. Love that it illuminates at after 7pm. Weekends are crowded but it's a great place to unwind and cool down in the scorching heat. Love the fact that the tables and area are constantly kept clean.\nPark is not the typical playground you see elsewhere. It is small but unique.\nNot a big fan of the food trucks. Heavily priced. Restrooms are clean but small.PlaygroundRock climbing, slide and others.RestroomsRestrooms are clean but small.",
      "rating": "5",
      "date": "10 months ago"
    },
    {
      "name": "fool",
      "comment": "This place was amazing to visit. I love the park facing the freeway in between many sky risers.",
      "rating": "5",
      "date": "3 months ago"
    },
    {
      "name": "Dez",
      "comment": "Klyde Warren Park: Urban Oasis for Fun & Food\n\nKlyde Warren Park is a fantastic spot for a day out in Dallas, especially if you're looking for something that caters to everyone. Here's what makes it a winner:\n\nFamily Fun:\n\nWide open fields: Perfect for kids to run around and burn off energy.\nPlaygrounds: Structures to keep the little ones entertained.\nGames galore: Four cornhole and foosball tables for friendly competition.\nWater features: The coolest part is the water play area, providing a refreshing way to beat the Texas heat (especially for the kids!).\nFoodie Fun:\n\nFood trucks galore: With a variety of options, you're sure to find something everyone will enjoy.\nRestaurant options nearby: If you prefer a sit-down meal, there are restaurants surrounding the park.\nPicnic paradise: Pack a basket and enjoy a leisurely picnic amidst the urban landscape.\nOverall Vibe:\n\nOpen and spacious: Plenty of room to spread out and relax.\nGreat for gatherings: Perfect for picnics, birthday parties, or just hanging out with friends and family. +7",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "shauna mcknight",
      "comment": "My daughter's girlfriend Cassandra Florence turned me onto this place last year and I've been coming ever since. They have something for everyone of all backgrounds , food trucks , the Mexican restaurant you are able to walk up and get a drink for the adults , food trucks of all types for kids and you even one for pets it's truly amazing.PlaygroundLots of room to play and water all year round or so it seems we absolutely love it hereRestroomsOnly 2  bathrooms for women  in the park area still worth it and cleaned frequentlyPicnic areaLots of room for date or family fun or even  for yourself or your friends +2",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Sai P",
      "comment": "Great place for kids. The enclosed play scapes provided safe and fun and vibrant environment for kids to play. There are activities for all ages . The bathrooms are locked that is the only gripe. Must visit.",
      "rating": "5",
      "date": "8 months ago"
    },
    {
      "name": "Rebecca Rainbolt",
      "comment": "We decided to walk over after having lunch down the street. The park is so clean and pretty. My granddaughter loved the play area. I really liked the water feature. It's a little stream of water. Just enough to dip your toes and cool off. They have food trucks available for a.meal or snack\nThe grass is off limits, but they do offer tables around the grass to have lunch or just enjoy the view.",
      "rating": "5",
      "date": "6 months ago"
    },
    {
      "name": "Katherine Wallace",
      "comment": "We were visiting Dallas for the first time in years. Our friends decided to bring us here. It was such an incredibly awesome surprise! Tons of families out playing. A great area for young children to play in. Beautiful places to just sit and hang out. Food trucks all around so you have places to eat. What an incredibly cool idea!",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Arturo Navarrete",
      "comment": "Very nice park in the middle of Dallas downtown. Water splash for kids to play. Food trucks to get a bite. Trolley runs on each side of the park and it is free. The Trolley takes you to restaurants,  movie theater, and whole foods among others places +3",
      "rating": "5",
      "date": "3 months ago"
    },
    {
      "name": "Lise S",
      "comment": "Food trucks to die for! Lots of seating, two play parks for kids with supervision. What a lovely place to spend the afternoon!",
      "rating": "5",
      "date": "8 months ago"
    },
    {
      "name": "Jeanette Jimenez",
      "comment": "Klyde Warren Park is a great place to gather with friends or family and play, walk around and enjoy time together. They also have food trucks and other vendors available.PlaygroundYesRestroomsYesDog-friendlinessYesPicnic areaAvailable",
      "rating": "5",
      "date": "6 months ago"
    },
    {
      "name": "Gustavo Rivera",
      "comment": "A public park in the District Art Zone. Good enough for kids an pets. Adults can feel is to small. Free to take out family. Some food trucks for fast food and a regular big restaurant.PlaygroundGood for kidsRestroomsClean enoughDog-friendlinessyesPicnic areasmall +2",
      "rating": "3",
      "date": "a year ago"
    },
    {
      "name": "Brian Ashby",
      "comment": "The most amazing green space in downtown Dallas.  The food trucks are a nice addition.  Definitely unique and worth a nosey around.  Crazy to think there's a giant road full of pissed off drivers sitting in bumper to bumper traffic under this park.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Nwanyi Mbaise",
      "comment": "⭐️⭐️⭐️⭐️⭐️ 5 Stars\n\nI took my dog, Lennox, to Klyde Warren Park and we had a wonderful time! The atmosphere was perfect, and the food trucks offered a great variety of delicious options. It’s a fantastic spot for both pets and people to enjoy a beautiful day out. We’ll definitely be back!",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Paul Herrle",
      "comment": "How adorable! Not a huge park but very sweet. People doing yoga on the lawn, moms with their kids in the water features, food trucks, people walking dogs, ping pong, chess, cornhole. Security presence easily seen. 2 restaurants right in the park but at least a dozen more within walking distance.\n\nWhat a lovely surprise in the heart of a city.",
      "rating": "5",
      "date": "3 months ago"
    },
    {
      "name": "Kayce Dervetski",
      "comment": "Beautiful park! It kept my 6 and 8 year old busy with the open green space to play football and soccer, the ping pong tables that had the paddles and balls there, the fountain, live music, and park! The industrial look of the kids park was … More",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Carrie Wolford",
      "comment": "Really neat to build a park on an overpass over a major highway. It was so lively, so much going on on a Saturday morning. A huge yoga class. A radio station was hosting an event. Families, couples, singles, kids, dogs. It is appealing to all types. This is where to go to track down all the good food trucks. More",
      "rating": "4",
      "date": "2 years ago"
    },
    {
      "name": "Rinku Kalita",
      "comment": "Lovely green space amidst the downtown be tall buildings. Lot of structurres for kids to play. A mini water splash area along with walking strip around the park. Lots of chairs and benches to sit and enjoy some ice cream or coffee. A trendy … More +15",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Chris Fravel",
      "comment": "Very nice park, especially with all of the food trucks, and grass fields for kids to play! Loved my afternoon there! More",
      "rating": "5",
      "date": "7 months ago"
    },
    {
      "name": "Jessica Newman",
      "comment": "This park is stunning and is identity and family cordial . Many individuals bring their adorable little dogs. It's a spotless park, they give kindness litter sacks incase you fail to remember yours at home . There is loads of food trucks. It's dependably a pleasant action happening for the family. Cherished it. +9",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Darwin D Pitts II",
      "comment": "Klyde Warren Park in Dallas, Texas, is a lively and welcoming space that truly embodies the spirit of the city. As a family-friendly destination, it offers something for everyone, from playful kids’ areas and splash fountains to relaxing … More",
      "rating": "4",
      "date": "8 months ago"
    },
    {
      "name": "Penny C",
      "comment": "There is often live music, a good variety of food trucks adjacently parked at the park and lots of tables and shade. The playground had a lot of features for older kids as well as a special area for toddlers. More +26",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Bruce InCharlotte",
      "comment": "This is a super cool park and I got to visit it on successive days. In the afternoon, there was some sort of frisbee match going on that looked",
      "rating": "4",
      "date": "a year ago"
    },
    {
      "name": "Hemanta Pant",
      "comment": "Klyde Warren Park is a fantastic place to hang out in Dallas! It's a vibrant urban park that offers something for everyone. You can enjoy a picnic on the lawn, play games with friends, or even catch live music performances. There are also … More",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Tom George",
      "comment": "Beautiful small park in the middle of downtown.  Beautiful especially at night time with fountain lights. Some food trucks are available ( you have to check their website on time and options on each day).",
      "rating": "5",
      "date": "a year ago"
    }
  ]
}