{
  "location": "Pacific Plaza",
  "scraped_at": "2025-12-03T16:01:45.508386",
  "coordinates": {
    "latitude": 32.7834406,
    "longitude": -96.795966
  },
  "total_reviews": 40,
  "reviews": [
    {
      "name": "Troy Windhorst",
      "comment": "Small green space in the midst of the concrete jungle this is downtown Dallas. Essentially a spot to take a break, with nothing spectacular, there are enough interesting features to please the eyes. +4",
      "rating": "4",
      "date": "3 weeks ago"
    },
    {
      "name": "J",
      "comment": "The architecture is unique and nice, but the homeless here are so hostile. We're just taking pictures and he harasses us saying he doesn't want him to be in the picture. Instead of enjoying the place we just left.  Don't come here.",
      "rating": "1",
      "date": "6 months ago"
    },
    {
      "name": "Margot B",
      "comment": "It was excellent. The No Kings Protest was violent free and excellent as well +3",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Freddy Govantes",
      "comment": "Went for No Kings Rally. Great turn out and super easy to get to.",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Bruce InCharlotte",
      "comment": "There was some sort of event being set up today (eclipse?) so I didn't get to explore Pacific Plaza as much as I would have liked. I could still walk around a bit. This lovely open and green space is airy and fresh and while there isn't a buffer for noise, it was still calmer and more peaceful than most.\n\nThe park has some swings and play space for the little ones. A small low fence around it would be helpful.PlaygroundThere are some play areas here.RestroomsI did not see any public restrooms.Dog-friendlinessLeashed dogs are permitted.Picnic areaThere is some seating here.",
      "rating": "4",
      "date": "a year ago"
    },
    {
      "name": "Lavette Dameron",
      "comment": "Dallas Soul Flower Music Fest! Great times and great vibes! ❤️",
      "rating": "5",
      "date": "5 months ago"
    },
    {
      "name": "Samuel Reed",
      "comment": "The place offered a peaceful break from city noise. The air was clean, and the environment felt safe. It was nice to see people respecting the space and keeping it neat.",
      "rating": "2",
      "date": "a month ago"
    },
    {
      "name": "Dena Sims",
      "comment": "Great vista in this downtown park. It appears to be in a courtyard surrounded by tall buildings. It’s a place to sit under many shade trees and people watch as the walk through the park. Sometimes I spot people playing soccer, football and frisbee.  The grass in this park is green and inviting +9",
      "rating": "5",
      "date": "3 years ago"
    },
    {
      "name": "Caden Alexander",
      "comment": "It's a nice park for walking dogs, but it's usually accompanied by a few homeless individuals.",
      "rating": "4",
      "date": "3 weeks ago"
    },
    {
      "name": "R4F4",
      "comment": "What to say about the Pacific Plaza?\n\nWhat a great place to sit down and relax, lay on the grass or grab and table and eat during lunch break. It also has a small playground with seesaws.seesaw.\n\nI highly recommend it!Picnic areaMany tables and seats.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Jason Russell",
      "comment": "Great little peaceful place right in the middle of downtown Dallas. Stop by here to have lunch while you're in the city really nice place. Lots of activities to do with your kids putting a of places just to sit and hang out. You should go check it out really nice +11",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Kenia L",
      "comment": "I wasn't expecting much, but it was quite nice, I'll definitely go back another time to hang out, it's comfortable, you can eat your food right there, and it's very nice to look around.",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "Perri-A Perri-A",
      "comment": "Sooo beautiful at night +24",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "Metro One Pest Control",
      "comment": "Great people!\nFamiliar setting!\n\nGreat to see so many people coming, It was fun and peaceful 🇺🇸💗",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Sam Towns",
      "comment": "This was a nice park and playground in walking distance from our hotel. The landscaping is beautiful and the building views set a nice scene. We had fun on a Sunday morning with our kids. The only thing was there was a large group of homeless people (30+) sleeping in one corner of the park which was a bit weird. It seems the city has a major homeless problem as we encountered them everywhere we went downtown.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Anand Arya",
      "comment": "Wonderful park and great views of the city. Small kids play area. Homeless people around it.",
      "rating": "4",
      "date": "5 months ago"
    },
    {
      "name": "Sara Boyer",
      "comment": "Lovely park! My Husband and I had fun walking around and exploring the area! It is a calming place to escape the hustle and bustle of the city!",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Maritza Ortega",
      "comment": "Fabulous addition to Downtown Dallas! A green space in the heart of Dallas with beautiful views of the city buildings! The best views happen at sunset!! +24",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Madison Rainbow",
      "comment": "This gorgeous 3.4 acre park opens October 14, 2019! +43",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Dezirae Rae",
      "comment": "I love this park. Its so open and beautiful! Our dogs love it. The park is pretty clean.",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Lonnie Wright",
      "comment": "We went to the no Kings protest number 2 there it was nice it rained that day quite hard for a little while",
      "rating": "5",
      "date": "a month ago"
    },
    {
      "name": "Aleisha Rutherford",
      "comment": "No shade on playground. Nice area but not suitable for children during the day when it’s hot out.",
      "rating": "2",
      "date": "a year ago"
    },
    {
      "name": "Judith Rojo-Gaxiola",
      "comment": "Great Park to relax in Down Town, pet friendly, very enjoyable +32",
      "rating": "5",
      "date": "5 years ago"
    },
    {
      "name": "Tasnim Ara Islam",
      "comment": "The 3.7 acre Pacific Plaza is a public park in Downtown Dallas.  This urban oaisis provides a grassy respite amongst the oversized downtown buildings. The park offers multi-purpose central lawn, playgrounds, etc. The park’s 95-by-138-foot pavilion has a steel panel pierced with the morse code signature of every local stop along the Texas and Pacific Railroad between New Orleans and El Paso. That is really impressive.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Shayer S",
      "comment": "Nice little green space near the hotels. Enough space to let the kids run around under watchful eyes and not be worried about traffic.",
      "rating": "4",
      "date": "4 years ago"
    },
    {
      "name": "Steve D",
      "comment": "Beautiful architecture in Dallas downtown, so much of open space.",
      "rating": "5",
      "date": "3 years ago"
    },
    {
      "name": "Javier Olivarez",
      "comment": "Puptopia was held here and Dexter really enjoyed himself! Hope more events are held at this plaza!",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "Yo Passion",
      "comment": "Nice swings , places to sit with table and chairs also good trails and pretty Xmas lights already .. i usually come down here and swing and look at the high-rises. It’s very nice.\none of my favorite parks in Dallas.",
      "rating": "4",
      "date": "2 years ago"
    },
    {
      "name": "Self University (SELF UNIVERSITY)",
      "comment": "Is a Great Plaze to spend when your family!",
      "rating": "5",
      "date": "2 months ago"
    },
    {
      "name": "Eric Larsen",
      "comment": "Great park outside the smell of weed +3",
      "rating": "3",
      "date": "a year ago"
    },
    {
      "name": "Kain Bowman",
      "comment": "I",
      "rating": "5",
      "date": "10 months ago"
    },
    {
      "name": "Juliana Chesser",
      "comment": "This is such a lovely park to hang out! A hidden gem ♡",
      "rating": "5",
      "date": "3 years ago"
    },
    {
      "name": "Angela Smith",
      "comment": "This downtown park has a fantastic view. It looks",
      "rating": "4",
      "date": "2 years ago"
    },
    {
      "name": "jhonny Sanabria",
      "comment": "💉🩸🩹🧊🦠🚬👎 …",
      "rating": "1",
      "date": "2 months ago"
    },
    {
      "name": "Asia Boyd",
      "comment": "Y’all got homeless people sleep on the park where kids supposed to be able to play at",
      "rating": "1",
      "date": "a year ago"
    },
    {
      "name": "Tommy Tom",
      "comment": "A very nice and quiet outer space that is open but you feel safe and secure and don't have to worry about being around anyone but whom you are with. This place is perfect for a intimate anything or a meeting location or Study or just to sit and live to best life while downtown dallas.... TRY it",
      "rating": "5",
      "date": "3 years ago"
    },
    {
      "name": "Jeff Clarkson",
      "comment": "Beautiful park, open space, great place to relax!",
      "rating": "5",
      "date": "4 years ago"
    },
    {
      "name": "momo morris",
      "comment": "Nice little park to chill. Nice scenery.",
      "rating": "5",
      "date": "3 years ago"
    },
    {
      "name": "jasean cajunboi",
      "comment": "Well it's a wonderful park and I really enjoy the scenery. But the bathroom has been down for almost two weeks now and its not far that we as the public people who pay tax dollars to come to a park ware the bathroom is not properly fixed and it's still closed. Please fix this issue ware people's can use the bathroom. Thank you.",
      "rating": "4",
      "date": "4 years ago"
    },
    {
      "name": "Kaitlyn Nicholson",
      "comment": "Do not go here unless you",
      "rating": "1",
      "date": "2 years ago"
    }
  ]
}