{
  "location": "Civic Garden",
  "scraped_at": "2025-12-03T15:59:11.095115",
  "coordinates": {
    "latitude": 32.7795971,
    "longitude": -96.8022293
  },
  "total_reviews": 30,
  "reviews": [
    {
      "name": "Samuel Reed",
      "comment": "The area was perfect for families. It had enough space for kids to play and adults to relax. The maintenance staff did a great job keeping it clean and welcoming.",
      "rating": "2",
      "date": "a month ago"
    },
    {
      "name": "R4F4",
      "comment": "What to say about the Civic Center?\n\nWhat an amazing park and leisure area that offers green grass areas to lay down and relax and many tables and chairs to take a break during work. Make sure you take the time and read what the park was built for.\n\nI highly recommend it!",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Fil Lorinc",
      "comment": "The natural elements and the water feature are nice but the grounds are frequented by displaced individuals so this can create somewhat of a clash for folks that aren't used to it.",
      "rating": "4",
      "date": "a year ago"
    },
    {
      "name": "TJ Smith",
      "comment": "I thought it was going to be super nice however it is was full of unhoused people hanging out. I'm glad they have a spot to go",
      "rating": "2",
      "date": "3 weeks ago"
    },
    {
      "name": "Kenia L",
      "comment": "It's comfortable and visually pleasing, however, I thought it would be much bigger, but in reality it's too small, but if you just want to sit for a while, I guess you'll enjoy it.",
      "rating": "3",
      "date": "4 months ago"
    },
    {
      "name": "Tracy Torbett",
      "comment": "We visited 4/20/19 in the early evening.  It was a refreshing place to enjoy some greenery and watch the city of Dallas. A street performer was playing guitar nearby which added to the allure.  Within walking distance to many hotels downtown, don’t miss this beautiful spot!",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Natalie Jaroszewski",
      "comment": "Very small, but cute. I liked it enough to take some of my civic wedding photos there. :)\nOf course it is right in the middle of major streets, so not a good pet area.\nThere a few picnic tables, and the butterfly statues are cool for kids.",
      "rating": "3",
      "date": "2 years ago"
    },
    {
      "name": "Abhilasha A Rathi",
      "comment": "Such a fun place to go anytime. Kids enjoy water splash.PlaygroundIt's good space for kids to run around.RestroomsNo restroomsDog-friendlinessYesPicnic areaIt's a very comfortable place for picnic only on good weather days.",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Lawrence Mendoza",
      "comment": "A great place to take a stroll or just sit. It is also a dog friendly park. It is overall a very good place to go to enjoy the scenery.",
      "rating": "5",
      "date": "9 years ago"
    },
    {
      "name": "Melissa Anderson",
      "comment": "Not a bad view  anyway you look. Love this park. Just one more reason I  am  blessed  to call Dallas home! +5",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "Matthew L",
      "comment": "So very peaceful brought my cat he loved it will definitely go again very soon 😊 …",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "Carlo Esposito",
      "comment": "It’s a nice walk in the park in downtown Dallas! Just beware of not stepping in dog droppings as some people will not pick up after their pets.",
      "rating": "4",
      "date": "5 years ago"
    },
    {
      "name": "Hany Ramzy",
      "comment": "It’s the kinda pretty that makes you wanna call your grandma and tell her about it.",
      "rating": "4",
      "date": "4 months ago"
    },
    {
      "name": "Rich Paxton",
      "comment": "Beautiful at night. Fountains in the center is a great way to entertain the kids on a hot day. But too many homeless people hanging out in the table area.",
      "rating": "4",
      "date": "8 years ago"
    },
    {
      "name": "Dmitriy Mykalo",
      "comment": "Civic Garden is a beautiful and serene park with well-maintained gardens and a peaceful atmosphere. The interactive fountain is a highlight, and the park's layout is perfect for a relaxing stroll. It's a great spot to unwind and enjoy nature in the city.",
      "rating": "5",
      "date": "9 months ago"
    },
    {
      "name": "Gary Thompson",
      "comment": "Good spot to eat lunch after spending time in the courthouse!",
      "rating": "5",
      "date": "4 months ago"
    },
    {
      "name": "Anand Arya",
      "comment": "Nice park, needs some cleanliness. People need to stop throwing trash outside the trash bin.",
      "rating": "4",
      "date": "5 months ago"
    },
    {
      "name": "Veronika Pliusnina",
      "comment": "Very nice place to refresh yourself while being outside. Not crowded at all",
      "rating": "5",
      "date": "8 years ago"
    },
    {
      "name": "Rich KR",
      "comment": "Small park in Downtown Dallas.  Perfect for a short rest or relaxation.  Lots of benches plus a green oasis of vegetation give a sense of peace.",
      "rating": "5",
      "date": "3 years ago"
    },
    {
      "name": "Henry Yoder",
      "comment": "Very cool lights and a nice place to chill downtown.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Don Muchow",
      "comment": "Nice shady spot in downtown Dallas with picnic tables and water fountain and flowers.",
      "rating": "5",
      "date": "2 years ago"
    },
    {
      "name": "Amilcar Lopez",
      "comment": "Great place to visit......",
      "rating": "5",
      "date": "11 months ago"
    },
    {
      "name": "Angel XXX",
      "comment": "We went and enjoyed the scenery early morning. Was nice and peaceful. The water, people walking dogs. A couple of homeless wandering around but super friendly and everyone minds their own business. ALOT of security walks through to give you the safety feel. Also many people cleaning the park. A new spot",
      "rating": "5",
      "date": "3 years ago"
    },
    {
      "name": "Seth Salamanca",
      "comment": "Nice place to enjoy a lunch. +3",
      "rating": "5",
      "date": "6 years ago"
    },
    {
      "name": "J A",
      "comment": "Nice and chill place to walk around",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Alin Guadarrama",
      "comment": "Beautiful at night it has a show with the water fountains it goes with the beat of the song it’s really pretty and the playgrounds look so much fun I wish I was little to play there jaja",
      "rating": "5",
      "date": "a year ago"
    },
    {
      "name": "Ms. Qweenie Smith Davis",
      "comment": "My honey took me to see the butterflies!! Such a great place and so romantic!!",
      "rating": "5",
      "date": "8 years ago"
    },
    {
      "name": "Erin Lux",
      "comment": "Nice place to eat a picnic lunch in the middle of town",
      "rating": "5",
      "date": "8 years ago"
    },
    {
      "name": "Kkey Hicks",
      "comment": "The homeless population has really taken over",
      "rating": "1",
      "date": "3 months ago"
    },
    {
      "name": "Heiderose Reed",
      "comment": "I didn't",
      "rating": "4",
      "date": "8 years ago"
    }
  ]
}