{
  "source_url": "https://www.google.com/maps/place/Dallas+City+Hall/@32.7764113,-96.7996532,793m/data=!3m2!1e3!5s0x864e991c03758f79:0xac1d27b870f77243!4m16!1m9!3m8!1s0x864e991c01a6bfd1:0x37ec98d77ccc70aa!2sDallas+City+Hall!8m2!3d32.7764068!4d-96.7970783!9m1!1b1!16s%2Fg%2F1tdpmh9k!3m5!1s0x864e991c01a6bfd1:0x37ec98d77ccc70aa!8m2!3d32.7764068!4d-96.7970783!16s%2Fg%2F1tdpmh9k?entry=ttu&g_ep=EgoyMDI1MTEyMy4xIKXMDSoASAFQAw%3D%3D",
  "coordinates": {
    "latitude": 32.7764113,
    "longitude": -96.7996532
  },
  "keywords": [],
  "reviews": [
    {
      "name": "Jonathan Stevenson",
      "comment": "",
      "rating": 5.0,
      "date": "a week ago"
    },
    {
      "name": "Alan Farris",
      "comment": "Tear down this upside down bunker and lease some office space. Maybe use the land for something cooler than basketball",
      "rating": 1.0,
      "date": "a week ago"
    },
    {
      "name": "John McDonald",
      "comment": "Great Experience",
      "rating": 5.0,
      "date": "2 weeks ago"
    },
    {
      "name": "Amanda T",
      "comment": "There is no help no support no nothing in this city of dallas only setting you up for failure.. the eviction process you all have going is nothing but a assembly line.. This city is so big on getting money but no leadership!!! Families are homeless losing more everyday the city allows these outside realstate companies come out here and charge you for a new place to live and then put you out.. The eviction process is nothing but a game to this city... There is no housing programs for working people there is no program for the young men or children and the young men grown up.To busy trying to lock people up and give them chargers to mess there future up!! But worried about parks but people can't even go to parks without being harassed by your polices...this city ain't what it use to be.. Become a victim of identity and try to explain that to the DPS they laugh at you..but what if it was your identity taken advantage by relatives..or etc..Alot of important people spoke up and made this city but the people we got representing the City of Dallas are weak and only paying there bills Pay the city you can do whatever you want",
      "rating": 1.0,
      "date": "2 weeks ago"
    },
    {
      "name": "a buahs",
      "comment": "Quiet",
      "rating": 5.0,
      "date": "3 weeks ago"
    },
    {
      "name": "Christopher Reid",
      "comment": "",
      "rating": 5.0,
      "date": "a month ago"
    },
    {
      "name": "Yeganeh Bahraminejad",
      "comment": "I went to Dallas City Hall and was looking for a specific office. When I asked Felicia Gooch for help, she kindly came down several floors to show me where I needed to go. When she noticed that the office was closed, she walked back with me and showed me another place where I could get help. She was very kind and friendly, and even though it wasn’t part of her job, she guided me out of pure kindness. The security officers at the entrance and on the second floor were also very kind and helpful",
      "rating": 5.0,
      "date": "a month ago"
    },
    {
      "name": "Diana Yanez",
      "comment": "We went to dallas water and the person that took care of us was so helpful, also the men that is greeting everyone telling you what to do to get the process going was super nice",
      "rating": 5.0,
      "date": "a month ago"
    },
    {
      "name": "Allie MacCoy",
      "comment": "Government building",
      "rating": 5.0,
      "date": "2 months ago"
    },
    {
      "name": "Kelly Terry",
      "comment": "I’m not sure if this is the right place to leave this review but if someone could pass this along to DFD, please do. I was at Kroger this morning and DFD had a ladder truck there to get groceries (I think Truck 19). My son loves fire trucks (he’s 5) and so we walked over to look at the truck. I thought all the firefighters were inside, but as we walked up to the truck, one of the firefighters was sitting in the front. He waved at us and as soon as we got close he jumped out and started talking to my son. He offered to show him the back, he was super friendly and seemed genuinely excited to show a young child his truck. It was incredibly nice and I just wanted to say thank you. It made a kid’s day, he talked about it the whole way home! Unfortunately I did not catch the firefighter’s name but he was a Lieutenant. That kind of community outreach is so important and deserves recognition. If anyone in the Dallas government knows who it might have been, tell him thank you for me",
      "rating": 5.0,
      "date": "2 months ago"
    },
    {
      "name": "Donald Brown",
      "comment": "Weirdest thing I've ever experienced shut down to have my lunch in front of Dallas City Hall when did the benches at shady by a tree and was told by security that we couldn't sit there, they didn't give us any reason why that was solid\nSo I pay taxes I buy my loss but I can't sit on government property make some sense to me because they were running homeless people off however I'm not homeless",
      "rating": 1.0,
      "date": "2 months ago"
    },
    {
      "name": "Kanika Morris",
      "comment": "",
      "rating": 5.0,
      "date": "3 months ago"
    },
    {
      "name": "Gen X",
      "comment": "",
      "rating": 5.0,
      "date": "3 months ago"
    },
    {
      "name": "Lia Landim Peuckert",
      "comment": "Too hot Translated by Google ・ See original (German)",
      "rating": 5.0,
      "date": "4 months ago"
    },
    {
      "name": "Rob",
      "comment": "Interesting architecture",
      "rating": 5.0,
      "date": "5 months ago"
    },
    {
      "name": "K Locke",
      "comment": "Good",
      "rating": 5.0,
      "date": "6 months ago"
    },
    {
      "name": "Lissette Robles",
      "comment": "",
      "rating": 5.0,
      "date": "6 months ago"
    },
    {
      "name": "De Shawn Mack",
      "comment": "",
      "rating": 4.0,
      "date": "6 months ago"
    },
    {
      "name": "Rene Fierro",
      "comment": "They were very helpful and directed me to where I needed to go",
      "rating": 5.0,
      "date": "6 months ago"
    },
    {
      "name": "Kimya Banks",
      "comment": "",
      "rating": 5.0,
      "date": "6 months ago"
    }
  ]
}